package main

import (
	"fmt"
	"strings"
	"testing"

	"github.com/franela/goblin"
)

// The possibility of conducting tests in a specific group:
// For more details see testing_helper.go
//
// go test -v -count=1 ./...
// go test -v -count=1 -run Basic ./...
// go test -v -count=1 -run BasicMasculine ./...

func TestBasicMasculine(t *testing.T) {
	g := goblin.Goblin(t)

	getTitleOf := func(cases []string, caseNum int) string {
		return fmt.Sprintf("%s: %-10s => %s",
			getLastLetters(string(cases[C_NOMINATIVE]), 2),
			string(cases[C_NOMINATIVE]),
			string(cases[caseNum]),
		)
	}

	g.Describe("Basic: Masculine", func() {
		tdtItems := [][]string{
			{"", "Вʼячеслав", "Вʼячеслава", "Вʼячеславу", "Вʼячеслава", "Вʼячеславом", "Вʼячеславові", "Вʼячеславе"},
			{"", "Влад", "Влада", "Владу", "Влада", "Владом", "Владові", "Владе"},
			{"", "Водограй", "Водограя", "Водограю", "Водограя", "Водограєм", "Водограєві", "Водограє"},
			// {"", "Май", "Мая", "Маю", "Мая", "Маєм", "Маєві", "Маю"},
			{"", "Адам", "Адама", "Адаму", "Адама", "Адамом", "Адамові", "Адаме"},
			{"", "Іван", "Івана", "Івану", "Івана", "Іваном", "Іванові", "Іване"},
			{"", "Остап", "Остапа", "Остапу", "Остапа", "Остапом", "Остапові", "Остапе"},
			{"", "Стожар", "Стожара", "Стожару", "Стожара", "Стожаром", "Стожарові", "Стожаре"},
			{"", "Панас", "Панаса", "Панасу", "Панаса", "Панасом", "Панасові", "Панасе"},
			{"", "Гнат", "Гната", "Гнату", "Гната", "Гнатом", "Гнатові", "Гнате"},
			{"", "Палац", "Палаца", "Палацу", "Палаца", "Палацом", "Палацові", "Палаце"},
			{"", "Дибач", "Дибача", "Дибачу", "Дибача", "Дибачом", "Дибачові", "Дибаче"},
			{"", "Грива", "Гриви", "Гриві", "Гриву", "Гривою", "Гриві", "Гриво"},
			{"", "Слава", "Слави", "Славі", "Славу", "Славою", "Славі", "Славо"},
			{"", "Снага", "Снаги", "Сназі", "Снагу", "Снагою", "Сназі", "Снаго"},
			{"", "Куйбіда", "Куйбіди", "Куйбіді", "Куйбіду", "Куйбідою", "Куйбіді", "Куйбідо"},
			// {"", "Ладо", "Лада", "Ладу", "Лада", "Ладом", "Ладові", "Ладе"},
			{"", "Олександр", "Олександра", "Олександру", "Олександра", "Олександром", "Олександрові", "Олександре"},
			{"", "Лев", "Лева", "Леву", "Лева", "Левом", "Левові", "Леве"},
			// {"", "Олег", "Олега", "Олегу", "Олега", "Олегом", "Олегові", "Олеже"},
			{"", "Атрей", "Атрея", "Атрею", "Атрея", "Атреєм", "Атреєві", "Атреє"},
			// {"", "Соловей", "Соловʼя", "Соловʼєві", "Соловʼя", "Соловʼєм", "Соловʼї", "Соловʼю"},
			// {"", "Щек", "Щека", "Щеку", "Щека", "Щеком", "Щекові", "Щеку"},
			{"", "Артем", "Артема", "Артему", "Артема", "Артемом", "Артемові", "Артеме"},
			{"", "Семен", "Семена", "Семену", "Семена", "Семеном", "Семенові", "Семене"},
			// {"", "Гуляйвітер", "Гуляйвітра", "Гуляйвітру", "Гуляйвітра", "Гуляйвітром", "Гуляйвітрові", "Гуляйвітре"},
			{"", "Велет", "Велета", "Велету", "Велета", "Велетом", "Велетові", "Велете"},
			{"", "Позвізд", "Позвізда", "Позвізду", "Позвізда", "Позвіздом", "Позвіздові", "Позвізде"},
			{"", "Хорив", "Хорива", "Хориву", "Хорива", "Хоривом", "Хоривові", "Хориве"},
			{"", "Свирид", "Свирида", "Свириду", "Свирида", "Свиридом", "Свиридові", "Свириде"},
			// {"", "Кий", "Кия", "Кию", "Кия", "Києм", "Кию", "Кию"},
			// {"", "Малик", "Малика", "Малику", "Малика", "Маликом", "Маликові", "Малику"},
			{"", "Любомил", "Любомила", "Любомилу", "Любомила", "Любомилом", "Любомилові", "Любомиле"},
			{"", "Максим", "Максима", "Максиму", "Максима", "Максимом", "Максимові", "Максиме"},
			{"", "Валентин", "Валентина", "Валентину", "Валентина", "Валентином", "Валентинові", "Валентине"},
			{"", "Пилип", "Пилипа", "Пилипу", "Пилипа", "Пилипом", "Пилипові", "Пилипе"},
			{"", "Володимир", "Володимира", "Володимиру", "Володимира", "Володимиром", "Володимирові", "Володимире"},
			{"", "Борис", "Бориса", "Борису", "Бориса", "Борисом", "Борисові", "Борисе"},
			{"", "Осемрит", "Осемрита", "Осемриту", "Осемрита", "Осемритом", "Осемритові", "Осемрите"},
			{"", "Листвич", "Листвича", "Листвичу", "Листвича", "Листвичом", "Листвичові", "Листвиче"},
			{"", "Лука", "Луки", "Луці", "Луку", "Лукою", "Луці", "Луко"},
			// {"", "Левко", "Левка", "Левку", "Левка", "Левком", "Левкові", "Левку"},
			{"", "Микола", "Миколи", "Миколі", "Миколу", "Миколою", "Миколі", "Миколо"},
			// {"", "Святополк", "Святополка", "Святополку", "Святополка", "Святополком", "Святополкові", "Святополку"},
			// {"", "Данило", "Данила", "Данилу", "Данила", "Данилом", "Данилові", "Даниле"},
			// {"", "Василь", "Василя", "Василю", "Василя", "Василем", "Василеві", "Василю"},
			// {"", "Воля", "Волі", "Волі", "Волю", "Волею", "Волі", "Воле"},
			// {"", "Ілля", "Іллі", "Іллі", "Іллю", "Іллею", "Іллі", "Іллє"},
			{"", "Кузьма", "Кузьми", "Кузьмі", "Кузьму", "Кузьмою", "Кузьмі", "Кузьмо"},
			{"", "Іоанн", "Іоанна", "Іоанну", "Іоанна", "Іоанном", "Іоаннові", "Іоанне"},
			{"", "Добриня", "Добрині", "Добрині", "Добриню", "Добринею", "Добрині", "Добриню"},
			{"", "Остромов", "Остромова", "Остромову", "Остромова", "Остромовом", "Остромовові", "Остромове"},
			// {"", "Дарибог", "Дарибога", "Дарибогу", "Дарибога", "Дарибогом", "Дарибогові", "Дарибоже"},
			{"", "Всеволод", "Всеволода", "Всеволоду", "Всеволода", "Всеволодом", "Всеволодові", "Всеволоде"},
			// {"", "Бративой", "Бративоя", "Бративою", "Бративоя", "Бративоєм", "Бративоєві", "Бративою"},
			// {"", "Синьоок", "Синьоока", "Синьооку", "Синьоока", "Синьооком", "Синьоокові", "Синьооку"}, // Синьооче
			{"", "Фрол", "Фрола", "Фролу", "Фрола", "Фролом", "Фролові", "Фроле"},
			{"", "Автоном", "Автонома", "Автоному", "Автонома", "Автономом", "Автономові", "Автономе"},
			{"", "Мирон", "Мирона", "Мирону", "Мирона", "Мироном", "Миронові", "Мироне"},
			{"", "Віктор", "Віктора", "Віктору", "Віктора", "Віктором", "Вікторові", "Вікторе"},
			// {"", "Далібор", "Далібора", "Далібору", "Далібора", "Далібором", "Даліборові", "Даліборе"},
			// {"", "Єгор", "Єгора", "Єгору", "Єгора", "Єгором", "Єгорові", "Єгоре"},
			// {"", "Звенигор", "Звенигора", "Звенигору", "Звенигора", "Звенигором", "Звенигорові", "Звенигоре"},
			// {"", "Ігор", "Ігора", "Ігору", "Ігора", "Ігорем", "Ігореві", "Ігоре"},
			// {"", "Тімох", "Тімоха", "Тімоху", "Тімоха", "Тімохом", "Тімохові", "Тімоху"}, // Тімоше
			{"", "Ярош", "Яроша", "Ярошу", "Яроша", "Ярошом", "Ярошові", "Яроше"},
			{"", "Чара", "Чари", "Чарі", "Чару", "Чарою", "Чарі", "Чаро"},
			// {"", "Сварг", "Сварга", "Сваргу", "Сварга", "Сваргом", "Сваргові", "Сварго"}, // Сварже
			// {"", "Дмитро", "Дмитра", "Дмитру", "Дмитра", "Дмитром", "Дмитрові", "Дмитре"},
			{"", "Альберт", "Альберта", "Альберту", "Альберта", "Альбертом", "Альбертові", "Альберте"},
			{"", "Олекса", "Олекси", "Олексі", "Олексу", "Олексою", "Олексі", "Олексо"},
			{"", "Боримисл", "Боримисла", "Боримислу", "Боримисла", "Боримислом", "Боримислові", "Боримисле"},
			{"", "Орест", "Ореста", "Оресту", "Ореста", "Орестом", "Орестові", "Оресте"},
			// {"", "Тодось", "Тодося", "Тодосю", "Тодося", "Тодосем", "Тодосеві", "Тодосю"},
			{"", "Микита", "Микити", "Микиті", "Микиту", "Микитою", "Микиті", "Микито"},
			{"", "Вернидуб", "Вернидуба", "Вернидубу", "Вернидуба", "Вернидубом", "Вернидубові", "Вернидубе"},
			// {"", "Дорогобуг", "Дорогобуга", "Дорогобугу", "Дорогобуга", "Дорогобугом", "Дорогобугові", "Дорогобуже"},
			// {"", "Царук", "Царука", "Царуку", "Царука", "Царуком", "Царукові", "Царуче"},
			{"", "Авакум", "Авакума", "Авакуму", "Авакума", "Авакумом", "Авакумові", "Авакуме"},
			{"", "Горун", "Горуна", "Горуну", "Горуна", "Горуном", "Горунові", "Горуне"},
			{"", "Тимур", "Тимура", "Тимуру", "Тимура", "Тимуром", "Тимурові", "Тимуре"},
			{"", "Златоус", "Златоуса", "Златоусу", "Златоуса", "Златоусом", "Златоусові", "Златоусе"},
			// {"", "Милодух", "Милодуха", "Милодуху", "Милодуха", "Милодухом", "Милодухові", "Милодусе"}, // Милодуше
			// {"", "Одинець", "Одинця", "Одинцю", "Одинця", "Одинецем", "Одинецеві", "Одинецю"},
			{"", "Аскольд", "Аскольда", "Аскольду", "Аскольда", "Аскольдом", "Аскольдові", "Аскольде"},
			{"", "Життєлюб", "Життєлюба", "Життєлюбу", "Життєлюба", "Життєлюбом", "Життєлюбові", "Життєлюбе"},
			{"", "Вселюд", "Вселюда", "Вселюду", "Вселюда", "Вселюдом", "Вселюдові", "Вселюде"},
			{"", "Зорегляд", "Зорегляда", "Зорегляду", "Зорегляда", "Зореглядом", "Зореглядові", "Зорегляде"},

			{"", "Дем'ян", "Дем'яна", "Дем'яну", "Дем'яна", "Дем'яном", "Дем'янові", "Дем'яне"},
			{"", "Святояр", "Святояра", "Святояру", "Святояра", "Святояром", "Святоярові", "Святояре"},
			{"", "Пʼєр", "Пʼєра", "Пʼєру", "Пʼєра", "Пʼєром", "Пʼєрові", "Пʼєре"},
			{"", "Гліб", "Гліба", "Глібу", "Гліба", "Глібом", "Глібові", "Глібе"},
			{"", "Яків", "Якова", "Якову", "Якова", "Яковом", "Якові", "Якове"},
			// {"", "Триріг", "Трирога", "Трирогу", "Трирога", "Трирогом", "Трирогові", "Трирогу"}, // Трироже
			// {"", "Живорід", "Живорода", "Живороду", "Живорода", "Живородом", "Живородові", "Живороде"},
			{"", "Леонід", "Леоніда", "Леоніду", "Леоніда", "Леонідом", "Леонідові", "Леоніде"},
			// {"", "Рід", "Ріда", "Ріду", "Ріда", "Рідом", "Рідові", "Ріде"},
			// {"", "Турбрід", "Турбріда", "Турбріду", "Турбріда", "Турбрідом", "Турбрідові", "Турбріде"},
			// {"", "Андрій", "Андрія", "Андрію", "Андрія", "Андрієм", "Андрієві", "Андрію"},
			// {"", "Домінік", "Домініка", "Домініку", "Домініка", "Домініком", "Домінікові", "Домініку"}, // Домініче
			{"", "Сокіл", "Сокола", "Соколу", "Сокола", "Соколом", "Соколові", "Соколе"},
			{"", "Антін", "Антіна", "Антіну", "Антіна", "Антіном", "Антінові", "Антіне"},
			{"", "Вір", "Віра", "Віру", "Віра", "Віром", "Вірові", "Віре"},
			// {"", "Яснозір", "Яснозора", "Яснозору", "Яснозора", "Яснозором", "Яснозорові", "Яснозоре"},
			{"", "Горицвіт", "Горицвіта", "Горицвіту", "Горицвіта", "Горицвітом", "Горицвітові", "Горицвіте"},
			// {"", "Тиміш", "Тиміша", "Тимішу", "Тиміша", "Тимішем", "Тимішеві", "Тиміше"},
			{"", "Рафаїл", "Рафаїла", "Рафаїлу", "Рафаїла", "Рафаїлом", "Рафаїлові", "Рафаїле"},
		}

		// TODO:
		// test names with dashes
		//
		// g.Describe("Inflect names with dash", func() {
		// 	tdtItems := [][]string{
		// 	}

		// 	for _, cases := range tdtItems {
		// 		for caseNum := 2; caseNum < 8; caseNum++ {
		// 			name := cases[caseNum]

		// 			g.It(fmt.Sprintf("[%d] %-16s => %s", caseNum, cases[C_NOMINATIVE], name), func() {
		// 				lowNameParts := strings.Split(strings.ToLower(cases[C_NOMINATIVE]), "-")
		// 				result := femNounPartsToCaseN(lowNameParts, uint8(caseNum))
		// 				g.Assert(result).Equal(name)
		// 			})
		// 		}
		// 	}
		// })

		g.Describe("2. Nominative to Genitive", func() {
			for _, cases := range tdtItems {
				g.It(getTitleOf(cases, C_GENITIVE), func() {
					res := manNounToCaseN(strings.ToLower(cases[C_NOMINATIVE]), C_GENITIVE)
					g.Assert(res).Equal(cases[C_GENITIVE])
				})
			}
		})

		g.Describe("3. Nominative to Dative", func() {
			for _, cases := range tdtItems {
				g.It(getTitleOf(cases, C_DATIVE), func() {
					res := manNounToCaseN(strings.ToLower(cases[C_NOMINATIVE]), C_DATIVE)
					g.Assert(res).Equal(cases[C_DATIVE])
				})
			}
		})

		g.Describe("4. Nominative to Accusative", func() {
			for _, cases := range tdtItems {
				g.It(getTitleOf(cases, C_ACCUSATIVE), func() {
					res := manNounToCaseN(strings.ToLower(cases[C_NOMINATIVE]), C_ACCUSATIVE)
					g.Assert(res).Equal(cases[C_ACCUSATIVE])
				})
			}
		})

		g.Describe("5. Nominative to Instrumental", func() {
			for _, cases := range tdtItems {
				g.It(getTitleOf(cases, C_INSTRUMENTAL), func() {
					res := manNounToCaseN(strings.ToLower(cases[C_NOMINATIVE]), C_INSTRUMENTAL)
					g.Assert(res).Equal(cases[C_INSTRUMENTAL])
				})
			}
		})

		g.Describe("6. Nominative to Locative", func() {
			for _, cases := range tdtItems {
				g.It(getTitleOf(cases, C_LOCATIVE), func() {
					res := manNounToCaseN(strings.ToLower(cases[C_NOMINATIVE]), C_LOCATIVE)
					g.Assert(res).Equal(cases[C_LOCATIVE])
				})
			}
		})

		g.Describe("7. Nominative to Vocative", func() {
			for _, cases := range tdtItems {
				g.It(getTitleOf(cases, C_VOCATIVE), func() {
					res := manNounToCaseN(strings.ToLower(cases[C_NOMINATIVE]), C_VOCATIVE)
					g.Assert(res).Equal(cases[C_VOCATIVE])
				})
			}
		})
	})
}
