package main

import (
	"strings"
	"unicode"
)

const (
	C_NOMINATIVE   = 1 // Називний
	C_GENITIVE     = 2 // Родовий
	C_DATIVE       = 3 // Давальний
	C_ACCUSATIVE   = 4 // Знахідний
	C_INSTRUMENTAL = 5 // Орудний
	C_LOCATIVE     = 6 // Місцевий
	C_VOCATIVE     = 7 // Кличний
)

const StemEndings = "аяеєиіїоуюь"

var vocabulary = map[string][]string{
	// 1st Declension. Solid Group
	// (б,в,г,ґ,д,з,к,л,м,н,п,р,с,т,ф,х,ц)

	"ба": {"би", "бі", "бу", "бою", "бі", "бо"},
	"ва": {"ви", "ві", "ву", "вою", "ві", "во"},
	"га": {"ги", "зі", "гу", "гою", "зі", "го"},
	"ґа": {"ґи", "зі", "ґу", "ґою", "зі", "ґо"},
	"да": {"ди", "ді", "ду", "дою", "ді", "до"},
	"за": {"зи", "зі", "зу", "зою", "зі", "зо"},
	"ка": {"ки", "ці", "ку", "кою", "ці", "ко"},
	"ла": {"ли", "лі", "лу", "лою", "лі", "ло"},
	"ма": {"ми", "мі", "му", "мою", "мі", "мо"},
	"на": {"ни", "ні", "ну", "ною", "ні", "но"},
	"па": {"пи", "пі", "пу", "пою", "пі", "по"},
	"ра": {"ри", "рі", "ру", "рою", "рі", "ро"},
	"са": {"си", "сі", "су", "сою", "сі", "со"},
	"та": {"ти", "ті", "ту", "тою", "ті", "то"},
	"фа": {"фи", "фі", "фу", "фою", "фі", "фо"},
	"ха": {"хи", "сі", "ху", "хою", "сі", "хо"},
	"ца": {"ци", "ці", "цу", "цою", "ці", "цо"},

	// "аа": '?',
	// "еа": '?',
	// "иа": '?',
	// "іа": '?',
	// "оа": '?',
	// "уа": '?',
	// "їа": '?',
	// "єа": '?',
	// "юа": '?',
	// "яа": '?',
	// "йа": '?',
	// "ьа": '?',
	// "'а": {"ʼї", "ʼї", "ʼю", "ʼєю", "ʼї", "ʼє"},
	// "ʼа": {"ʼї", "ʼї", "ʼю", "ʼєю", "ʼї", "ʼє"},
	// "’а": {"ʼї", "ʼї", "ʼю", "ʼєю", "ʼї", "ʼє"},

	// 1st Declension. Mixed Group

	"жа": {"жі", "жі", "жу", "жею", "жі", "жо"}, // же
	"ча": {"чі", "чі", "чу", "чею", "чі", "чо"}, // че
	"ша": {"ші", "ші", "шу", "шею", "ші", "шо"}, // ше
	"ща": {"щі", "щі", "щу", "щею", "щі", "ще"}, // ще

	// 1st Declension. Soft Group

	"бя": {"бі", "бі", "бю", "бею", "бі", "бю"}, // бе
	"вя": {"ві", "ві", "вю", "вею", "ві", "вю"}, // ве
	"гя": {"гі", "гі", "гю", "гею", "гі", "гю"}, // ге
	"ґя": {"ґі", "ґі", "ґю", "ґею", "ґі", "ґю"}, // ґе
	"дя": {"ді", "ді", "дю", "дею", "ді", "дю"}, // де
	"зя": {"зі", "зі", "зю", "зею", "зі", "зю"}, // зе
	"кя": {"кі", "кі", "кю", "кею", "кі", "кю"}, // ке
	"ля": {"лі", "лі", "лю", "лею", "лі", "лю"}, // ле
	"мя": {"мі", "мі", "мю", "мею", "мі", "мю"}, // ме
	"ня": {"ні", "ні", "ню", "нею", "ні", "ню"}, // не
	"пя": {"пі", "пі", "пю", "пею", "пі", "пю"}, // пе
	"ря": {"рі", "рі", "рю", "рею", "рі", "рю"}, // ре
	"ся": {"сі", "сі", "сю", "сею", "сі", "сю"}, // се
	"тя": {"ті", "ті", "тю", "тею", "ті", "тю"}, // те
	"фя": {"фі", "фі", "фю", "фею", "фі", "фю"}, // фе
	"хя": {"хі", "хі", "хю", "хею", "хі", "хю"}, // хе
	"ця": {"ці", "ці", "цю", "цею", "ці", "цю"}, // це

	"ая": {"аї", "аї", "аю", "аєю", "аї", "ає"}, // аю
	"ея": {"еї", "еї", "ею", "еєю", "еї", "еє"},
	"ия": {"иї", "иї", "ию", "иєю", "иї", "иє"},
	"оя": {"ої", "ої", "ою", "оєю", "ої", "оє"},
	"уя": {"уї", "уї", "ую", "уєю", "уї", "ує"},
	"ія": {"ії", "ії", "ію", "ією", "ії", "іє"},
	"йя": {"йї", "йї", "йю", "йєю", "йї", "йє"},
	"ья": {"ьї", "ьї", "ью", "ьєю", "ьї", "ьє"},
	"'я": {"'ї", "'ї", "'ю", "'єю", "'ї", "'є"},
	"ʼя": {"ʼї", "ʼї", "ʼю", "ʼєю", "ʼї", "ʼє"},
	"’я": {"’ї", "’ї", "’ю", "’єю", "’ї", "’є"},
	// "їя": '?',
	// "єя": '?',
	// "юя": '?',
	// "яя": '?',

	// 3rd Declension.
	//
	// III відміна.
	//
	// Іменники жін. роду з кінцевим приголосним основи:
	// вість, любов, міць, річ, розкіш, сіль, тінь,
	// а також слово мати, в якому при відмінюванні з’являється суфікс -ер-.
	//
	// До третьої відміни належать іменники жіночого роду з нульовим закінченням
	// у називному відмінку однини (кров, ніч, сіль, відданість),
	// а також іменник мати.

	// б,в,г,ґ,д,ж,з,к,л,м,н,п,р,с,т,ф,х,ц,ч,ш
	// вість, любов, міць, річ, розкіш, сіль, тінь

	// "нь": {'ні', 'ні', 'нь', 'нню', 'ні', 'не'},
	// "ть": {'ті', 'ті', 'ть', 'тю', 'ті', 'те'},
	// "іч": {'очі', 'очі', 'іч', 'іччю', 'очі', 'оче'},
	// "ов": {'ові', 'ові', 'ов', 'овʼю', 'ові', 'ове'},
	// "ож": {'ожі', 'ожі', 'ож', 'іжжю', 'ожі', 'оже'},
}

func femNounToCaseN(name string, caseNum uint8) string {
	r := []rune(name)
	l := len(r)

	suffix := string(r[l-2:])

	if ending, exist := vocabulary[suffix]; exist {
		r = append(r[:l-2], []rune(ending[caseNum-2])...)
	}

	return runeUcFirst(r)
}

// Recursively extracts the stem of a word
func GetStem(word []rune) []rune {
	if l := len(word); l > 2 && strings.ContainsRune(StemEndings, word[l-1]) {
		word = GetStem(word[:l-1])
	}

	return word
}

func runeUcFirst(r []rune) string {
	return string(unicode.ToUpper(r[0])) + string(r[1:])
}

func getLastLetter(word string) string {
	runes := []rune(word)
	return string(runes[len(runes)-1])
}
