package main

import (
	"fmt"
	"strings"
	"testing"

	"github.com/franela/goblin"
)

// The possibility of conducting tests in a specific group:
// For more details see testing_helper.go
//
// go test -v -count=1 ./...
// go test -v -count=1 -run General ./...
// go test -v -count=1 -run GeneralFeminine ./...

func TestGeneralFeminine(t *testing.T) {
	g := goblin.Goblin(t)

	getTitleOf := func(cases []string, caseNum int) string {
		return fmt.Sprintf("%s: %-10s => %s",
			getLastLetters(string(cases[C_NOMINATIVE]), 2),
			string(cases[C_NOMINATIVE]),
			string(cases[caseNum]),
		)
	}

	g.Describe("General: Feminine", func() {
		tdtItems := [][]string{
			{"", "Гамалія", "Гамалії", "Гамалії", "Гамалію", "Гамалією", "Гамалії", "Гамаліє"},
			{"", "Аврелія", "Аврелії", "Аврелії", "Аврелію", "Аврелією", "Аврелії", "Авреліє"},
			{"", "Агапія", "Агапії", "Агапії", "Агапію", "Агапією", "Агапії", "Агапіє"},
			{"", "Агафія", "Агафії", "Агафії", "Агафію", "Агафією", "Агафії", "Агафіє"},
			{"", "Агія", "Агії", "Агії", "Агію", "Агією", "Агії", "Агіє"},
			{"", "Аграфія", "Аграфії", "Аграфії", "Аграфію", "Аграфією", "Аграфії", "Аграфіє"},
			{"", "Азалія", "Азалії", "Азалії", "Азалію", "Азалією", "Азалії", "Азаліє"},
			{"", "Аксенія", "Аксенії", "Аксенії", "Аксенію", "Аксенією", "Аксенії", "Аксеніє"},
			{"", "Алісія", "Алісії", "Алісії", "Алісію", "Алісією", "Алісії", "Алісіє"},
			{"", "Аліція", "Аліції", "Аліції", "Аліцію", "Аліцією", "Аліції", "Аліціє"},
			{"", "Алія", "Алії", "Алії", "Алію", "Алією", "Алії", "Аліє"},
			{"", "Амалія", "Амалії", "Амалії", "Амалію", "Амалією", "Амалії", "Амаліє"},
			{"", "Амелія", "Амелії", "Амелії", "Амелію", "Амелією", "Амелії", "Амеліє"},
			{"", "Анатолія", "Анатолії", "Анатолії", "Анатолію", "Анатолією", "Анатолії", "Анатоліє"},
			{"", "Анелія", "Анелії", "Анелії", "Анелію", "Анелією", "Анелії", "Анеліє"},
			{"", "Антонія", "Антонії", "Антонії", "Антонію", "Антонією", "Антонії", "Антоніє"},
			{"", "Аполлінарія", "Аполлінарії", "Аполлінарії", "Аполлінарію", "Аполлінарією", "Аполлінарії", "Аполлінаріє"},
			{"", "Аркадія", "Аркадії", "Аркадії", "Аркадію", "Аркадією", "Аркадії", "Аркадіє"},
			{"", "Арсенія", "Арсенії", "Арсенії", "Арсенію", "Арсенією", "Арсенії", "Арсеніє"},
			{"", "Артемія", "Артемії", "Артемії", "Артемію", "Артемією", "Артемії", "Артеміє"},
			{"", "Аспасія", "Аспасії", "Аспасії", "Аспасію", "Аспасією", "Аспасії", "Аспасіє"},
			{"", "Афанасія", "Афанасії", "Афанасії", "Афанасію", "Афанасією", "Афанасії", "Афанасіє"},
			{"", "Брія", "Брії", "Брії", "Брію", "Брією", "Брії", "Бріє"},
			{"", "Валерія", "Валерії", "Валерії", "Валерію", "Валерією", "Валерії", "Валеріє"},
			{"", "Варінія", "Варінії", "Варінії", "Варінію", "Варінією", "Варінії", "Варініє"},
			{"", "Веронія", "Веронії", "Веронії", "Веронію", "Веронією", "Веронії", "Вероніє"},
			{"", "Вікторія", "Вікторії", "Вікторії", "Вікторію", "Вікторією", "Вікторії", "Вікторіє"},
			{"", "Вініція", "Вініції", "Вініції", "Вініцію", "Вініцією", "Вініції", "Вініціє"},
			{"", "Віргінія", "Віргінії", "Віргінії", "Віргінію", "Віргінією", "Віргінії", "Віргініє"},
			{"", "Вірджінія", "Вірджінії", "Вірджінії", "Вірджінію", "Вірджінією", "Вірджінії", "Вірджініє"},
			{"", "Віталія", "Віталії", "Віталії", "Віталію", "Віталією", "Віталії", "Віталіє"},
			{"", "Вітторія", "Вітторії", "Вітторії", "Вітторію", "Вітторією", "Вітторії", "Вітторіє"},
			{"", "Гафія", "Гафії", "Гафії", "Гафію", "Гафією", "Гафії", "Гафіє"},
			{"", "Гіпатія", "Гіпатії", "Гіпатії", "Гіпатію", "Гіпатією", "Гіпатії", "Гіпатіє"},
			{"", "Гликерія", "Гликерії", "Гликерії", "Гликерію", "Гликерією", "Гликерії", "Гликеріє"},
			{"", "Дарія", "Дарії", "Дарії", "Дарію", "Дарією", "Дарії", "Даріє"},
			{"", "Денисія", "Денисії", "Денисії", "Денисію", "Денисією", "Денисії", "Денисіє"},
			{"", "Джулія", "Джулії", "Джулії", "Джулію", "Джулією", "Джулії", "Джуліє"},
			{"", "Докія", "Докії", "Докії", "Докію", "Докією", "Докії", "Докіє"},
			{"", "Домнікія", "Домнікії", "Домнікії", "Домнікію", "Домнікією", "Домнікії", "Домнікіє"},
			{"", "Емілія", "Емілії", "Емілії", "Емілію", "Емілією", "Емілії", "Еміліє"},
			{"", "Євгенія", "Євгенії", "Євгенії", "Євгенію", "Євгенією", "Євгенії", "Євгеніє"},
			{"", "Євдокія", "Євдокії", "Євдокії", "Євдокію", "Євдокією", "Євдокії", "Євдокіє"},
			{"", "Євлампія", "Євлампії", "Євлампії", "Євлампію", "Євлампією", "Євлампії", "Євлампіє"},
			{"", "Євпраксія", "Євпраксії", "Євпраксії", "Євпраксію", "Євпраксією", "Євпраксії", "Євпраксіє"},
			{"", "Євсевія", "Євсевії", "Євсевії", "Євсевію", "Євсевією", "Євсевії", "Євсевіє"},
			{"", "Євстафія", "Євстафії", "Євстафії", "Євстафію", "Євстафією", "Євстафії", "Євстафіє"},
			{"", "Євстахія", "Євстахії", "Євстахії", "Євстахію", "Євстахією", "Євстахії", "Євстахіє"},
			{"", "Євтихія", "Євтихії", "Євтихії", "Євтихію", "Євтихією", "Євтихії", "Євтихіє"},
			{"", "Євфрасія", "Євфрасії", "Євфрасії", "Євфрасію", "Євфрасією", "Євфрасії", "Євфрасіє"},
			{"", "Євфросинія", "Євфросинії", "Євфросинії", "Євфросинію", "Євфросинією", "Євфросинії", "Євфросиніє"},
			{"", "Єфимія", "Єфимії", "Єфимії", "Єфимію", "Єфимією", "Єфимії", "Єфиміє"},
			{"", "Єфросинія", "Єфросинії", "Єфросинії", "Єфросинію", "Єфросинією", "Єфросинії", "Єфросиніє"},
			{"", "Зиновія", "Зиновії", "Зиновії", "Зиновію", "Зиновією", "Зиновії", "Зиновіє"},
			{"", "Зіновія", "Зіновії", "Зіновії", "Зіновію", "Зіновією", "Зіновії", "Зіновіє"},
			{"", "Зофія", "Зофії", "Зофії", "Зофію", "Зофією", "Зофії", "Зофіє"},
			{"", "Зульфія", "Зульфії", "Зульфії", "Зульфію", "Зульфією", "Зульфії", "Зульфіє"},
			{"", "Іларія", "Іларії", "Іларії", "Іларію", "Іларією", "Іларії", "Іларіє"},
			{"", "Іфігенія", "Іфігенії", "Іфігенії", "Іфігенію", "Іфігенією", "Іфігенії", "Іфігеніє"},
			{"", "Калерія", "Калерії", "Калерії", "Калерію", "Калерією", "Калерії", "Калеріє"},
			{"", "Камалія", "Камалії", "Камалії", "Камалію", "Камалією", "Камалії", "Камаліє"},
			{"", "Касталія", "Касталії", "Касталії", "Касталію", "Касталією", "Касталії", "Касталіє"},
			{"", "Клавдія", "Клавдії", "Клавдії", "Клавдію", "Клавдією", "Клавдії", "Клавдіє"},
			{"", "Конкордія", "Конкордії", "Конкордії", "Конкордію", "Конкордією", "Конкордії", "Конкордіє"},
			{"", "Констанція", "Констанції", "Констанції", "Констанцію", "Констанцією", "Констанції", "Констанціє"},
			{"", "Корнелія", "Корнелії", "Корнелії", "Корнелію", "Корнелією", "Корнелії", "Корнеліє"},
			{"", "Ксенія", "Ксенії", "Ксенії", "Ксенію", "Ксенією", "Ксенії", "Ксеніє"},
			{"", "Лавінія", "Лавінії", "Лавінії", "Лавінію", "Лавінією", "Лавінії", "Лавініє"},
			{"", "Леокадія", "Леокадії", "Леокадії", "Леокадію", "Леокадією", "Леокадії", "Леокадіє"},
			{"", "Леонія", "Леонії", "Леонії", "Леонію", "Леонією", "Леонії", "Леоніє"},
			{"", "Леонсія", "Леонсії", "Леонсії", "Леонсію", "Леонсією", "Леонсії", "Леонсіє"},
			{"", "Леонтія", "Леонтії", "Леонтії", "Леонтію", "Леонтією", "Леонтії", "Леонтіє"},
			{"", "Летиція", "Летиції", "Летиції", "Летицію", "Летицією", "Летиції", "Летиціє"},
			{"", "Летісія", "Летісії", "Летісії", "Летісію", "Летісією", "Летісії", "Летісіє"},
			{"", "Ликерія", "Ликерії", "Ликерії", "Ликерію", "Ликерією", "Ликерії", "Ликеріє"},
			{"", "Лігія", "Лігії", "Лігії", "Лігію", "Лігією", "Лігії", "Лігіє"},
			{"", "Лідія", "Лідії", "Лідії", "Лідію", "Лідією", "Лідії", "Лідіє"},
			{"", "Лілія", "Лілії", "Лілії", "Лілію", "Лілією", "Лілії", "Ліліє"},
			{"", "Літісія", "Літісії", "Літісії", "Літісію", "Літісією", "Літісії", "Літісіє"},
			{"", "Лія", "Лії", "Лії", "Лію", "Лією", "Лії", "Ліє"},
			{"", "Лукерія", "Лукерії", "Лукерії", "Лукерію", "Лукерією", "Лукерії", "Лукеріє"},
			{"", "Лукія", "Лукії", "Лукії", "Лукію", "Лукією", "Лукії", "Лукіє"},
			{"", "Лукреція", "Лукреції", "Лукреції", "Лукрецію", "Лукрецією", "Лукреції", "Лукреціє"},
			{"", "Лусія", "Лусії", "Лусії", "Лусію", "Лусією", "Лусії", "Лусіє"},
			{"", "Люсія", "Люсії", "Люсії", "Люсію", "Люсією", "Люсії", "Люсіє"},
			{"", "Лютеція", "Лютеції", "Лютеції", "Лютецію", "Лютецією", "Лютеції", "Лютеціє"},
			{"", "Люція", "Люції", "Люції", "Люцію", "Люцією", "Люції", "Люціє"},
			{"", "Лючія", "Лючії", "Лючії", "Лючію", "Лючією", "Лючії", "Лючіє"},
			{"", "Марія", "Марії", "Марії", "Марію", "Марією", "Марії", "Маріє"},
			{"", "Марсалія", "Марсалії", "Марсалії", "Марсалію", "Марсалією", "Марсалії", "Марсаліє"},
			{"", "Меланія", "Меланії", "Меланії", "Меланію", "Меланією", "Меланії", "Меланіє"},
			{"", "Мія", "Мії", "Мії", "Мію", "Мією", "Мії", "Міє"},
			{"", "Надія", "Надії", "Надії", "Надію", "Надією", "Надії", "Надіє"},
			{"", "Настасія", "Настасії", "Настасії", "Настасію", "Настасією", "Настасії", "Настасіє"},
			{"", "Наталія", "Наталії", "Наталії", "Наталію", "Наталією", "Наталії", "Наталіє"},
			{"", "Оділія", "Оділії", "Оділії", "Оділію", "Оділією", "Оділії", "Оділіє"},
			{"", "Оксенія", "Оксенії", "Оксенії", "Оксенію", "Оксенією", "Оксенії", "Оксеніє"},
			{"", "Октавія", "Октавії", "Октавії", "Октавію", "Октавією", "Октавії", "Октавіє"},
			{"", "Олівія", "Олівії", "Олівії", "Олівію", "Олівією", "Олівії", "Олівіє"},
			{"", "Ольвія", "Ольвії", "Ольвії", "Ольвію", "Ольвією", "Ольвії", "Ольвіє"},
			{"", "Онисія", "Онисії", "Онисії", "Онисію", "Онисією", "Онисії", "Онисіє"},
			{"", "Параскевія", "Параскевії", "Параскевії", "Параскевію", "Параскевією", "Параскевії", "Параскевіє"},
			{"", "Парасковія", "Парасковії", "Парасковії", "Парасковію", "Парасковією", "Парасковії", "Парасковіє"},
			{"", "Парфенія", "Парфенії", "Парфенії", "Парфенію", "Парфенією", "Парфенії", "Парфеніє"},
			{"", "Патриція", "Патриції", "Патриції", "Патрицію", "Патрицією", "Патриції", "Патриціє"},
			{"", "Патрісія", "Патрісії", "Патрісії", "Патрісію", "Патрісією", "Патрісії", "Патрісіє"},
			{"", "Пелагія", "Пелагії", "Пелагії", "Пелагію", "Пелагією", "Пелагії", "Пелагіє"},
			{"", "Піонія", "Піонії", "Піонії", "Піонію", "Піонією", "Піонії", "Піоніє"},
			{"", "Полонія", "Полонії", "Полонії", "Полонію", "Полонією", "Полонії", "Полоніє"},
			{"", "Пульхерія", "Пульхерії", "Пульхерії", "Пульхерію", "Пульхерією", "Пульхерії", "Пульхеріє"},
			{"", "Розалія", "Розалії", "Розалії", "Розалію", "Розалією", "Розалії", "Розаліє"},
			{"", "Сезарія", "Сезарії", "Сезарії", "Сезарію", "Сезарією", "Сезарії", "Сезаріє"},
			{"", "Сесилія", "Сесилії", "Сесилії", "Сесилію", "Сесилією", "Сесилії", "Сесиліє"},
			{"", "Сильвія", "Сильвії", "Сильвії", "Сильвію", "Сильвією", "Сильвії", "Сильвіє"},
			{"", "Синтія", "Синтії", "Синтії", "Синтію", "Синтією", "Синтії", "Синтіє"},
			{"", "Сільвія", "Сільвії", "Сільвії", "Сільвію", "Сільвією", "Сільвії", "Сільвіє"},
			{"", "Сінтія", "Сінтії", "Сінтії", "Сінтію", "Сінтією", "Сінтії", "Сінтіє"},
			{"", "Соломія", "Соломії", "Соломії", "Соломію", "Соломією", "Соломії", "Соломіє"},
			{"", "Софія", "Софії", "Софії", "Софію", "Софією", "Софії", "Софіє"},
			{"", "Степанія", "Степанії", "Степанії", "Степанію", "Степанією", "Степанії", "Степаніє"},
			{"", "Стефанія", "Стефанії", "Стефанії", "Стефанію", "Стефанією", "Стефанії", "Стефаніє"},
			{"", "Таїсія", "Таїсії", "Таїсії", "Таїсію", "Таїсією", "Таїсії", "Таїсіє"},
			{"", "Теодозія", "Теодозії", "Теодозії", "Теодозію", "Теодозією", "Теодозії", "Теодозіє"},
			{"", "Теофілія", "Теофілії", "Теофілії", "Теофілію", "Теофілією", "Теофілії", "Теофіліє"},
			{"", "Терезія", "Терезії", "Терезії", "Терезію", "Терезією", "Терезії", "Терезіє"},
			{"", "Тодосія", "Тодосії", "Тодосії", "Тодосію", "Тодосією", "Тодосії", "Тодосіє"},
			{"", "Февронія", "Февронії", "Февронії", "Февронію", "Февронією", "Февронії", "Февроніє"},
			{"", "Февросія", "Февросії", "Февросії", "Февросію", "Февросією", "Февросії", "Февросіє"},
			{"", "Федосія", "Федосії", "Федосії", "Федосію", "Федосією", "Федосії", "Федосіє"},
			{"", "Фелісія", "Фелісії", "Фелісії", "Фелісію", "Фелісією", "Фелісії", "Фелісіє"},
			{"", "Феліція", "Феліції", "Феліції", "Феліцію", "Феліцією", "Феліції", "Феліціє"},
			{"", "Феодосія", "Феодосії", "Феодосії", "Феодосію", "Феодосією", "Феодосії", "Феодосіє"},
			{"", "Феодотія", "Феодотії", "Феодотії", "Феодотію", "Феодотією", "Феодотії", "Феодотіє"},
			{"", "Феонія", "Феонії", "Феонії", "Феонію", "Феонією", "Феонії", "Феоніє"},
			{"", "Феофанія", "Феофанії", "Феофанії", "Феофанію", "Феофанією", "Феофанії", "Феофаніє"},
			{"", "Флавія", "Флавії", "Флавії", "Флавію", "Флавією", "Флавії", "Флавіє"},
			{"", "Флорія", "Флорії", "Флорії", "Флорію", "Флорією", "Флорії", "Флоріє"},
			{"", "Фотинія", "Фотинії", "Фотинії", "Фотинію", "Фотинією", "Фотинії", "Фотиніє"},
			{"", "Хатія", "Хатії", "Хатії", "Хатію", "Хатією", "Хатії", "Хатіє"},
			{"", "Хрисія", "Хрисії", "Хрисії", "Хрисію", "Хрисією", "Хрисії", "Хрисіє"},
			{"", "Хулія", "Хулії", "Хулії", "Хулію", "Хулією", "Хулії", "Хуліє"},
			{"", "Цецилія", "Цецилії", "Цецилії", "Цецилію", "Цецилією", "Цецилії", "Цециліє"},
			{"", "Цецілія", "Цецілії", "Цецілії", "Цецілію", "Цецілією", "Цецілії", "Цеціліє"},
			{"", "Юлія", "Юлії", "Юлії", "Юлію", "Юлією", "Юлії", "Юліє"},
			{"", "Юнія", "Юнії", "Юнії", "Юнію", "Юнією", "Юнії", "Юніє"},

			{"", "Аглая", "Аглаї", "Аглаї", "Аглаю", "Аглаєю", "Аглаї", "Аглає"},
			{"", "Даная", "Данаї", "Данаї", "Данаю", "Данаєю", "Данаї", "Данає"},
			{"", "Кая", "Каї", "Каї", "Каю", "Каєю", "Каї", "Кає"},
			{"", "Мая", "Маї", "Маї", "Маю", "Маєю", "Маї", "Має"},
			{"", "Навзікая", "Навзікаї", "Навзікаї", "Навзікаю", "Навзікаєю", "Навзікаї", "Навзікає"},
			{"", "Тая", "Таї", "Таї", "Таю", "Таєю", "Таї", "Тає"},

			{"", "Аделя", "Аделі", "Аделі", "Аделю", "Аделею", "Аделі", "Аделю"},
			{"", "Аля", "Алі", "Алі", "Алю", "Алею", "Алі", "Алю"},
			{"", "Анеля", "Анелі", "Анелі", "Анелю", "Анелею", "Анелі", "Анелю"},
			{"", "Валя", "Валі", "Валі", "Валю", "Валею", "Валі", "Валю"},
			{"", "Воля", "Волі", "Волі", "Волю", "Волею", "Волі", "Волю"},
			{"", "Галя", "Галі", "Галі", "Галю", "Галею", "Галі", "Галю"},
			{"", "Даля", "Далі", "Далі", "Далю", "Далею", "Далі", "Далю"},
			{"", "Єля", "Єлі", "Єлі", "Єлю", "Єлею", "Єлі", "Єлю"},
			{"", "Киля", "Килі", "Килі", "Килю", "Килею", "Килі", "Килю"},
			{"", "Леля", "Лелі", "Лелі", "Лелю", "Лелею", "Лелі", "Лелю"},
			{"", "Ліля", "Лілі", "Лілі", "Лілю", "Лілею", "Лілі", "Лілю"},
			{"", "Міля", "Мілі", "Мілі", "Мілю", "Мілею", "Мілі", "Мілю"},
			{"", "Наталя", "Наталі", "Наталі", "Наталю", "Наталею", "Наталі", "Наталю"},
			{"", "Неля", "Нелі", "Нелі", "Нелю", "Нелею", "Нелі", "Нелю"},
			{"", "Оля", "Олі", "Олі", "Олю", "Олею", "Олі", "Олю"},
			{"", "Рухля", "Рухлі", "Рухлі", "Рухлю", "Рухлею", "Рухлі", "Рухлю"},
			{"", "Уля", "Улі", "Улі", "Улю", "Улею", "Улі", "Улю"},
			{"", "Циля", "Цилі", "Цилі", "Цилю", "Цилею", "Цилі", "Цилю"},
			{"", "Юля", "Юлі", "Юлі", "Юлю", "Юлею", "Юлі", "Юлю"},

			{"", "Аллуся", "Аллусі", "Аллусі", "Аллусю", "Аллусею", "Аллусі", "Аллусю"},
			{"", "Ася", "Асі", "Асі", "Асю", "Асею", "Асі", "Асю"},
			{"", "Валюся", "Валюсі", "Валюсі", "Валюсю", "Валюсею", "Валюсі", "Валюсю"},
			{"", "Ганнуся", "Ганнусі", "Ганнусі", "Ганнусю", "Ганнусею", "Ганнусі", "Ганнусю"},
			{"", "Гася", "Гасі", "Гасі", "Гасю", "Гасею", "Гасі", "Гасю"},
			{"", "Дануся", "Данусі", "Данусі", "Данусю", "Данусею", "Данусі", "Данусю"},
			{"", "Даруся", "Дарусі", "Дарусі", "Дарусю", "Дарусею", "Дарусі", "Дарусю"},
			{"", "Зося", "Зосі", "Зосі", "Зосю", "Зосею", "Зосі", "Зосю"},
			{"", "Іруся", "Ірусі", "Ірусі", "Ірусю", "Ірусею", "Ірусі", "Ірусю"},
			{"", "Кася", "Касі", "Касі", "Касю", "Касею", "Касі", "Касю"},
			{"", "Катруся", "Катрусі", "Катрусі", "Катрусю", "Катрусею", "Катрусі", "Катрусю"},
			{"", "Люся", "Люсі", "Люсі", "Люсю", "Люсею", "Люсі", "Люсю"},
			{"", "Малгося", "Малгосі", "Малгосі", "Малгосю", "Малгосею", "Малгосі", "Малгосю"},
			{"", "Манюся", "Манюсі", "Манюсі", "Манюсю", "Манюсею", "Манюсі", "Манюсю"},
			{"", "Марися", "Марисі", "Марисі", "Марисю", "Марисею", "Марисі", "Марисю"},
			{"", "Мартуся", "Мартусі", "Мартусі", "Мартусю", "Мартусею", "Мартусі", "Мартусю"},
			{"", "Маруся", "Марусі", "Марусі", "Марусю", "Марусею", "Марусі", "Марусю", "Марусе"},
			{"", "Мася", "Масі", "Масі", "Масю", "Масею", "Масі", "Масю"},
			{"", "Мелася", "Меласі", "Меласі", "Меласю", "Меласею", "Меласі", "Меласю"},
			{"", "Мирося", "Миросі", "Миросі", "Миросю", "Миросею", "Миросі", "Миросю"},
			{"", "Міся", "Місі", "Місі", "Місю", "Місею", "Місі", "Місю"},
			{"", "Муся", "Мусі", "Мусі", "Мусю", "Мусею", "Мусі", "Мусю"},
			{"", "Настася", "Настасі", "Настасі", "Настасю", "Настасею", "Настасі", "Настасю"},
			{"", "Настуся", "Настусі", "Настусі", "Настусю", "Настусею", "Настусі", "Настусю"},
			{"", "Натуся", "Натусі", "Натусі", "Натусю", "Натусею", "Натусі", "Натусю"},
			{"", "Нуся", "Нусі", "Нусі", "Нусю", "Нусею", "Нусі", "Нусю"},
			{"", "Нюся", "Нюсі", "Нюсі", "Нюсю", "Нюсею", "Нюсі", "Нюсю"},
			{"", "Олеся", "Олесі", "Олесі", "Олесю", "Олесею", "Олесі", "Олесю"},
			{"", "Онися", "Онисі", "Онисі", "Онисю", "Онисею", "Онисі", "Онисю"},
			{"", "Орися", "Орисі", "Орисі", "Орисю", "Орисею", "Орисі", "Орисю"},
			{"", "Парася", "Парасі", "Парасі", "Парасю", "Парасею", "Парасі", "Парасю"},
			{"", "Пріся", "Прісі", "Прісі", "Прісю", "Прісею", "Прісі", "Прісю"},
			{"", "Руся", "Русі", "Русі", "Русю", "Русею", "Русі", "Русю"},
			{"", "Стася", "Стасі", "Стасі", "Стасю", "Стасею", "Стасі", "Стасю"},
			{"", "Стеся", "Стесі", "Стесі", "Стесю", "Стесею", "Стесі", "Стесю"},
			{"", "Тася", "Тасі", "Тасі", "Тасю", "Тасею", "Тасі", "Тасю"},
			{"", "Тодося", "Тодосі", "Тодосі", "Тодосю", "Тодосею", "Тодосі", "Тодосю"},
			{"", "Тося", "Тосі", "Тосі", "Тосю", "Тосею", "Тосі", "Тосю"},
			{"", "Туся", "Тусі", "Тусі", "Тусю", "Тусею", "Тусі", "Тусю"},
			{"", "Уляся", "Улясі", "Улясі", "Улясю", "Улясею", "Улясі", "Улясю"},
			{"", "Федося", "Федосі", "Федосі", "Федосю", "Федосею", "Федосі", "Федосю"},
			{"", "Феся", "Фесі", "Фесі", "Фесю", "Фесею", "Фесі", "Фесю"},
			{"", "Фрося", "Фросі", "Фросі", "Фросю", "Фросею", "Фросі", "Фросю"},
			{"", "Хитруся", "Хитрусі", "Хитрусі", "Хитрусю", "Хитрусею", "Хитрусі", "Хитрусю"},
			{"", "Яся", "Ясі", "Ясі", "Ясю", "Ясею", "Ясі", "Ясю"},

			{"", "Андрея", "Андреї", "Андреї", "Андрею", "Андреєю", "Андреї", "Андреє"},
			{"", "Антінея", "Антінеї", "Антінеї", "Антінею", "Антінеєю", "Антінеї", "Антінеє"},
			{"", "Віринея", "Віринеї", "Віринеї", "Віринею", "Віринеєю", "Віринеї", "Віринеє"},
			{"", "Галатея", "Галатеї", "Галатеї", "Галатею", "Галатеєю", "Галатеї", "Галатеє"},
			{"", "Доротея", "Доротеї", "Доротеї", "Доротею", "Доротеєю", "Доротеї", "Доротеє"},
			{"", "Дорофея", "Дорофеї", "Дорофеї", "Дорофею", "Дорофеєю", "Дорофеї", "Дорофеє"},
			{"", "Дульсінея", "Дульсінеї", "Дульсінеї", "Дульсінею", "Дульсінеєю", "Дульсінеї", "Дульсінеє"},
			{"", "Дульцінея", "Дульцінеї", "Дульцінеї", "Дульцінею", "Дульцінеєю", "Дульцінеї", "Дульцінеє"},
			{"", "Кассіопея", "Кассіопеї", "Кассіопеї", "Кассіопею", "Кассіопеєю", "Кассіопеї", "Кассіопеє"},
			{"", "Лея", "Леї", "Леї", "Лею", "Леєю", "Леї", "Леє"},
			{"", "Медея", "Медеї", "Медеї", "Медею", "Медеєю", "Медеї", "Медеє"},
			{"", "Пелагея", "Пелагеї", "Пелагеї", "Пелагею", "Пелагеєю", "Пелагеї", "Пелагеє"},
			{"", "Психея", "Психеї", "Психеї", "Психею", "Психеєю", "Психеї", "Психеє"},
			{"", "Саломея", "Саломеї", "Саломеї", "Саломею", "Саломеєю", "Саломеї", "Саломеє"},
			{"", "Серсея", "Серсеї", "Серсеї", "Серсею", "Серсеєю", "Серсеї", "Серсеє"},
			{"", "Цірцея", "Цірцеї", "Цірцеї", "Цірцею", "Цірцеєю", "Цірцеї", "Цірцеє"},

			{"", "Аня", "Ані", "Ані", "Аню", "Анею", "Ані", "Аню"},
			{"", "Валюня", "Валюні", "Валюні", "Валюню", "Валюнею", "Валюні", "Валюню"},
			{"", "Ваня", "Вані", "Вані", "Ваню", "Ванею", "Вані", "Ваню"},
			{"", "Віруня", "Віруні", "Віруні", "Віруню", "Вірунею", "Віруні", "Віруню"},
			{"", "Ганя", "Гані", "Гані", "Ганю", "Ганею", "Гані", "Ганю"},
			{"", "Груня", "Груні", "Груні", "Груню", "Грунею", "Груні", "Груню"},
			{"", "Даруня", "Даруні", "Даруні", "Даруню", "Дарунею", "Даруні", "Даруню"},
			{"", "Дуня", "Дуні", "Дуні", "Дуню", "Дунею", "Дуні", "Дуню"},
			{"", "Женя", "Жені", "Жені", "Женю", "Женею", "Жені", "Женю"},
			{"", "Зоня", "Зоні", "Зоні", "Зоню", "Зонею", "Зоні", "Зоню"},
			{"", "Ксеня", "Ксені", "Ксені", "Ксеню", "Ксенею", "Ксені", "Ксеню"},
			{"", "Лесюня", "Лесюні", "Лесюні", "Лесюню", "Лесюнею", "Лесюні", "Лесюню"},
			{"", "Любаня", "Любані", "Любані", "Любаню", "Любанею", "Любані", "Любаню"},
			{"", "Маня", "Мані", "Мані", "Маню", "Манею", "Мані", "Маню"},
			{"", "Мариня", "Марині", "Марині", "Мариню", "Маринею", "Марині", "Мариню"},
			{"", "Масяня", "Масяні", "Масяні", "Масяню", "Масянею", "Масяні", "Масяню"},
			{"", "Настуня", "Настуні", "Настуні", "Настуню", "Настунею", "Настуні", "Настуню"},
			{"", "Олюня", "Олюні", "Олюні", "Олюню", "Олюнею", "Олюні", "Олюню"},
			{"", "Параня", "Парані", "Парані", "Параню", "Паранею", "Парані", "Параню"},
			{"", "Риня", "Рині", "Рині", "Риню", "Ринею", "Рині", "Риню"},
			{"", "Роня", "Роні", "Роні", "Роню", "Ронею", "Роні", "Роню"},
			{"", "Саня", "Сані", "Сані", "Саню", "Санею", "Сані", "Саню"},
			{"", "Сашуня", "Сашуні", "Сашуні", "Сашуню", "Сашунею", "Сашуні", "Сашуню"},
			{"", "Соня", "Соні", "Соні", "Соню", "Сонею", "Соні", "Соню"},
			{"", "Таня", "Тані", "Тані", "Таню", "Танею", "Тані", "Таню"},
			{"", "Фаня", "Фані", "Фані", "Фаню", "Фанею", "Фані", "Фаню"},

			{"", "Дарʼя", "Дарʼї", "Дарʼї", "Дарʼю", "Дарʼєю", "Дарʼї", "Дарʼє"},
			{"", "Зофʼя", "Зофʼї", "Зофʼї", "Зофʼю", "Зофʼєю", "Зофʼї", "Зофʼє"},
			{"", "Марʼя", "Марʼї", "Марʼї", "Марʼю", "Марʼєю", "Марʼї", "Марʼє"},
			{"", "Тарʼя", "Тарʼї", "Тарʼї", "Тарʼю", "Тарʼєю", "Тарʼї", "Тарʼє"},

			{"", "Вандзя", "Вандзі", "Вандзі", "Вандзю", "Вандзею", "Вандзі", "Вандзю"},
			{"", "Рузя", "Рузі", "Рузі", "Рузю", "Рузею", "Рузі", "Рузю"},
			{"", "Теодозя", "Теодозі", "Теодозі", "Теодозю", "Теодозею", "Теодозі", "Теодозю"},
			{"", "Тодозя", "Тодозі", "Тодозі", "Тодозю", "Тодозею", "Тодозі", "Тодозю"},
			{"", "Фрузя", "Фрузі", "Фрузі", "Фрузю", "Фрузею", "Фрузі", "Фрузю"},
			{"", "Юзя", "Юзі", "Юзі", "Юзю", "Юзею", "Юзі", "Юзю"},
			{"", "Ядзя", "Ядзі", "Ядзі", "Ядзю", "Ядзею", "Ядзі", "Ядзю"},

			{"", "Варя", "Варі", "Варі", "Варю", "Варею", "Варі", "Варю"},
			{"", "Мотря", "Мотрі", "Мотрі", "Мотрю", "Мотрею", "Мотрі", "Мотрю"},
			{"", "Хівря", "Хіврі", "Хіврі", "Хіврю", "Хіврею", "Хіврі", "Хіврю"},

			{"", "Надя", "Наді", "Наді", "Надю", "Надею", "Наді", "Надю"},

			{"", "Вустя", "Вусті", "Вусті", "Вустю", "Вустею", "Вусті", "Вустю"},
			{"", "Густя", "Густі", "Густі", "Густю", "Густею", "Густі", "Густю"},
			{"", "Катя", "Каті", "Каті", "Катю", "Катею", "Каті", "Катю"},
			{"", "Мотя", "Моті", "Моті", "Мотю", "Мотею", "Моті", "Мотю"},
			{"", "Настя", "Насті", "Насті", "Настю", "Настею", "Насті", "Настю"},
			{"", "Устя", "Усті", "Усті", "Устю", "Устею", "Усті", "Устю"},
			{"", "Харитя", "Хариті", "Хариті", "Харитю", "Харитею", "Хариті", "Харитю"},

			{"", "Дарця", "Дарці", "Дарці", "Дарцю", "Дарцею", "Дарці", "Дарцю"},
			{"", "Марця", "Марці", "Марці", "Марцю", "Марцею", "Марці", "Марцю"},
			{"", "Милиця", "Милиці", "Милиці", "Милицю", "Милицею", "Милиці", "Милицю"},
			{"", "Стефця", "Стефці", "Стефці", "Стефцю", "Стефцею", "Стефці", "Стефцю"},

			{"", "Калліроя", "Каллірої", "Каллірої", "Каллірою", "Калліроєю", "Каллірої", "Калліроє"},
			{"", "Хлоя", "Хлої", "Хлої", "Хлою", "Хлоєю", "Хлої", "Хлоє"},

			{"", "Кайя", "Кайї", "Кайї", "Кайю", "Кайєю", "Кайї", "Кайє"},
			{"", "Мерайя", "Мерайї", "Мерайї", "Мерайю", "Мерайєю", "Мерайї", "Мерайє"},
		}

		g.Describe("Inflect names with dash", func() {
			tdtItems := [][]string{
				{"", "Ганна-Марія", "Ганни-Марії", "Ганні-Марії", "Ганну-Марію", "Ганною-Марією", "Ганні-Марії", "Ганно-Маріє"},
				{"", "Марія-Терезія", "Марії-Терезії", "Марії-Терезії", "Марію-Терезію", "Марією-Терезією", "Марії-Терезії", "Маріє-Терезіє"},
				{"", "Мері-Марія", "Мері-Марії", "Мері-Марії", "Мері-Марію", "Мері-Марією", "Мері-Марії", "Мері-Маріє"},
				{"", "Одетта-Оділія", "Одетти-Оділії", "Одетті-Оділії", "Одетту-Оділію", "Одеттою-Оділією", "Одетті-Оділії", "Одетто-Оділіє"},
				{"", "Софі-Марія", "Софі-Марії", "Софі-Марії", "Софі-Марію", "Софі-Марією", "Софі-Марії", "Софі-Маріє"},
				{"", "Марія-Антуанетта", "Марії-Антуанетти", "Марії-Антуанетті", "Марію-Антуанетту", "Марією-Антуанеттою", "Марії-Антуанетті", "Маріє-Антуанетто"},
				{"", "Марія-Луїза", "Марії-Луїзи", "Марії-Луїзі", "Марію-Луїзу", "Марією-Луїзою", "Марії-Луїзі", "Маріє-Луїзо"},
			}

			for _, cases := range tdtItems {
				for caseNum := 2; caseNum < 8; caseNum++ {
					name := cases[caseNum]

					g.It(fmt.Sprintf("[%d] %-16s => %s", caseNum, cases[C_NOMINATIVE], name), func() {
						lowNameParts := strings.Split(strings.ToLower(cases[C_NOMINATIVE]), "-")
						result := femNounPartsToCaseN(lowNameParts, uint8(caseNum))
						g.Assert(result).Equal(name)
					})
				}
			}
		})

		g.Describe("2. Nominative to Genitive", func() {
			for _, cases := range tdtItems {
				g.It(getTitleOf(cases, C_GENITIVE), func() {
					res := femNounToCaseN(strings.ToLower(cases[C_NOMINATIVE]), C_GENITIVE)
					g.Assert(res).Equal(cases[C_GENITIVE])
				})
			}
		})

		g.Describe("3. Nominative to Dative", func() {
			for _, cases := range tdtItems {
				g.It(getTitleOf(cases, C_DATIVE), func() {
					res := femNounToCaseN(strings.ToLower(cases[C_NOMINATIVE]), C_DATIVE)
					g.Assert(res).Equal(cases[C_DATIVE])
				})
			}
		})

		g.Describe("4. Nominative to Accusative", func() {
			for _, cases := range tdtItems {
				g.It(getTitleOf(cases, C_ACCUSATIVE), func() {
					res := femNounToCaseN(strings.ToLower(cases[C_NOMINATIVE]), C_ACCUSATIVE)
					g.Assert(res).Equal(cases[C_ACCUSATIVE])
				})
			}
		})

		g.Describe("5. Nominative to Instrumental", func() {
			for _, cases := range tdtItems {
				g.It(getTitleOf(cases, C_INSTRUMENTAL), func() {
					res := femNounToCaseN(strings.ToLower(cases[C_NOMINATIVE]), C_INSTRUMENTAL)
					g.Assert(res).Equal(cases[C_INSTRUMENTAL])
				})
			}
		})

		g.Describe("6. Nominative to Locative", func() {
			for _, cases := range tdtItems {
				g.It(getTitleOf(cases, C_LOCATIVE), func() {
					res := femNounToCaseN(strings.ToLower(cases[C_NOMINATIVE]), C_LOCATIVE)
					g.Assert(res).Equal(cases[C_LOCATIVE])
				})
			}
		})

		g.Describe("7. Nominative to Vocative", func() {
			for _, cases := range tdtItems {
				g.It(getTitleOf(cases, C_VOCATIVE), func() {
					res := femNounToCaseN(strings.ToLower(cases[C_NOMINATIVE]), C_VOCATIVE)
					g.Assert(res).Equal(cases[C_VOCATIVE])
				})
			}
		})
	})
}
