package main

import (
	"fmt"
	"strings"
	"testing"

	"github.com/franela/goblin"
)

// The possibility of conducting tests in a specific group:
// For more details see testing_helper.go
//
// go test -v -count=1 ./...
// go test -v -count=1 -run General ./...
// go test -v -count=1 -run GeneralMasculine ./...

func TestGeneralMasculine(t *testing.T) {
	g := goblin.Goblin(t)

	getTitleOf := func(cases []string, caseNum int) string {
		return fmt.Sprintf("%s: %-10s => %s",
			getLastLetters(string(cases[C_NOMINATIVE]), 2),
			string(cases[C_NOMINATIVE]),
			string(cases[caseNum]),
		)
	}

	g.Describe("General: Masculine", func() {
		tdtItems := [][]string{
			{"", "Білослав", "Білослава", "Білославу", "Білослава", "Білославом", "Білославові", "Білославе"},
			{"", "Богуслав", "Богуслава", "Богуславу", "Богуслава", "Богуславом", "Богуславові", "Богуславе"},
			{"", "Болеслав", "Болеслава", "Болеславу", "Болеслава", "Болеславом", "Болеславові", "Болеславе"},
			{"", "Борислав", "Борислава", "Бориславу", "Борислава", "Бориславом", "Бориславові", "Бориславе"},
			{"", "Братислав", "Братислава", "Братиславу", "Братислава", "Братиславом", "Братиславові", "Братиславе"},
			{"", "Братослав", "Братослава", "Братославу", "Братослава", "Братославом", "Братославові", "Братославе"},
			{"", "Брячислав", "Брячислава", "Брячиславу", "Брячислава", "Брячиславом", "Брячиславові", "Брячиславе"},
			{"", "Боронислав", "Боронислава", "Борониславу", "Боронислава", "Борониславом", "Борониславові", "Борониславе"},
			{"", "Будислав", "Будислава", "Будиславу", "Будислава", "Будиславом", "Будиславові", "Будиславе"},
			{"", "Вернислав", "Вернислава", "Верниславу", "Вернислава", "Верниславом", "Верниславові", "Верниславе"},
			{"", "Вишеслав", "Вишеслава", "Вишеславу", "Вишеслава", "Вишеславом", "Вишеславові", "Вишеславе"},
			{"", "Вірослав", "Вірослава", "Вірославу", "Вірослава", "Вірославом", "Вірославові", "Вірославе"},
			{"", "Владислав", "Владислава", "Владиславу", "Владислава", "Владиславом", "Владиславові", "Владиславе"},
			{"", "Водотрав", "Водотрава", "Водотраву", "Водотрава", "Водотравом", "Водотравові", "Водотраве"},
			{"", "Воїслав", "Воїслава", "Воїславу", "Воїслава", "Воїславом", "Воїславові", "Воїславе"},
			{"", "Володислав", "Володислава", "Володиславу", "Володислава", "Володиславом", "Володиславові", "Володиславе"},
			{"", "Воротислав", "Воротислава", "Воротиславу", "Воротислава", "Воротиславом", "Воротиславові", "Воротиславе"},
			{"", "Вратислав", "Вратислава", "Вратиславу", "Вратислава", "Вратиславом", "Вратиславові", "Вратиславе"},
			{"", "Всеслав", "Всеслава", "Всеславу", "Всеслава", "Всеславом", "Всеславові", "Всеславе"},
			{"", "В'ячеслав", "В'ячеслава", "В'ячеславу", "В'ячеслава", "В'ячеславом", "В'ячеславові", "В'ячеславе"},
			{"", "Гарнослав", "Гарнослава", "Гарнославу", "Гарнослава", "Гарнославом", "Гарнославові", "Гарнославе"},
			{"", "Гатуслав", "Гатуслава", "Гатуславу", "Гатуслава", "Гатуславом", "Гатуславові", "Гатуславе"},
			{"", "Гордислав", "Гордислава", "Гордиславу", "Гордислава", "Гордиславом", "Гордиславові", "Гордиславе"},
			{"", "Гордослав", "Гордослава", "Гордославу", "Гордослава", "Гордославом", "Гордославові", "Гордославе"},
			{"", "Горислав", "Горислава", "Гориславу", "Горислава", "Гориславом", "Гориславові", "Гориславе"},
			{"", "Градислав", "Градислава", "Градиславу", "Градислава", "Градиславом", "Градиславові", "Градиславе"},
			{"", "Гранислав", "Гранислава", "Граниславу", "Гранислава", "Граниславом", "Граниславові", "Граниславе"},
			{"", "Гремислав", "Гремислава", "Гремиславу", "Гремислава", "Гремиславом", "Гремиславові", "Гремиславе"},
			{"", "Держислав", "Держислава", "Держиславу", "Держислава", "Держиславом", "Держиславові", "Держиславе"},
			{"", "Доброслав", "Доброслава", "Доброславу", "Доброслава", "Доброславом", "Доброславові", "Доброславе"},
			{"", "Домослав", "Домослава", "Домославу", "Домослава", "Домославом", "Домославові", "Домославе"},
			{"", "Живослав", "Живослава", "Живославу", "Живослава", "Живославом", "Живославові", "Живославе"},
			{"", "Збоїслав", "Збоїслава", "Збоїславу", "Збоїслава", "Збоїславом", "Збоїславові", "Збоїславе"},
			{"", "Зборислав", "Зборислава", "Збориславу", "Зборислава", "Збориславом", "Збориславові", "Збориславе"},
			{"", "Звенислав", "Звенислава", "Звениславу", "Звенислава", "Звениславом", "Звениславові", "Звениславе"},
			{"", "Земислав", "Земислава", "Земиславу", "Земислава", "Земиславом", "Земиславові", "Земиславе"},
			{"", "Зореслав", "Зореслава", "Зореславу", "Зореслава", "Зореславом", "Зореславові", "Зореславе"},
			{"", "Івантослав", "Івантослава", "Івантославу", "Івантослава", "Івантославом", "Івантославові", "Івантославе"},
			{"", "Ізяслав", "Ізяслава", "Ізяславу", "Ізяслава", "Ізяславом", "Ізяславові", "Ізяславе"},
			{"", "Києслав", "Києслава", "Києславу", "Києслава", "Києславом", "Києславові", "Києславе"},
			{"", "Княжослав", "Княжослава", "Княжославу", "Княжослава", "Княжославом", "Княжославові", "Княжославе"},
			{"", "Ладислав", "Ладислава", "Ладиславу", "Ладислава", "Ладиславом", "Ладиславові", "Ладиславе"},
			{"", "Ліпослав", "Ліпослава", "Ліпославу", "Ліпослава", "Ліпославом", "Ліпославові", "Ліпославе"},
			{"", "Любослав", "Любослава", "Любославу", "Любослава", "Любославом", "Любославові", "Любославе"},
			{"", "Людислав", "Людислава", "Людиславу", "Людислава", "Людиславом", "Людиславові", "Людиславе"},
			{"", "Магаслав", "Магаслава", "Магаславу", "Магаслава", "Магаславом", "Магаславові", "Магаславе"},
			{"", "Мечислав", "Мечислава", "Мечиславу", "Мечислава", "Мечиславом", "Мечиславові", "Мечиславе"},
			{"", "Милослав", "Милослава", "Милославу", "Милослава", "Милославом", "Милославові", "Милославе"},
			{"", "Мирослав", "Мирослава", "Мирославу", "Мирослава", "Мирославом", "Мирославові", "Мирославе"},
			{"", "Мстислав", "Мстислава", "Мстиславу", "Мстислава", "Мстиславом", "Мстиславові", "Мстиславе"},
			{"", "Наслав", "Наслава", "Наславу", "Наслава", "Наславом", "Наславові", "Наславе"},
			{"", "Нігослав", "Нігослава", "Нігославу", "Нігослава", "Нігославом", "Нігославові", "Нігославе"},
			{"", "Переяслав", "Переяслава", "Переяславу", "Переяслава", "Переяславом", "Переяславові", "Переяславе"},
			{"", "Пребислав", "Пребислава", "Пребиславу", "Пребислава", "Пребиславом", "Пребиславові", "Пребиславе"},
			{"", "Предислав", "Предислава", "Предиславу", "Предислава", "Предиславом", "Предиславові", "Предиславе"},
			{"", "Радослав", "Радослава", "Радославу", "Радослава", "Радославом", "Радославові", "Радославе"},
			{"", "Ратислав", "Ратислава", "Ратиславу", "Ратислава", "Ратиславом", "Ратиславові", "Ратиславе"},
			{"", "Родослав", "Родослава", "Родославу", "Родослава", "Родославом", "Родославові", "Родославе"},
			{"", "Ростислав", "Ростислава", "Ростиславу", "Ростислава", "Ростиславом", "Ростиславові", "Ростиславе"},
			{"", "Світослав", "Світослава", "Світославу", "Світослава", "Світославом", "Світославові", "Світославе"},
			{"", "Святослав", "Святослава", "Святославу", "Святослава", "Святославом", "Святославові", "Святославе"},
			{"", "Силослав", "Силослава", "Силославу", "Силослава", "Силославом", "Силославові", "Силославе"},
			{"", "Собіслав", "Собіслава", "Собіславу", "Собіслава", "Собіславом", "Собіславові", "Собіславе"},
			{"", "Станислав", "Станислава", "Станиславу", "Станислава", "Станиславом", "Станиславові", "Станиславе"},
			{"", "Судислав", "Судислава", "Судиславу", "Судислава", "Судиславом", "Судиславові", "Судиславе"},
			{"", "Тарослав", "Тарослава", "Тарославу", "Тарослава", "Тарославом", "Тарославові", "Тарославе"},
			{"", "Твердислав", "Твердислава", "Твердиславу", "Твердислава", "Твердиславом", "Твердиславові", "Твердиславе"},
			{"", "Творислав", "Творислава", "Твориславу", "Творислава", "Твориславом", "Твориславові", "Твориславе"},
			{"", "Толислав", "Толислава", "Толиславу", "Толислава", "Толиславом", "Толиславові", "Толиславе"},
			{"", "Чеслав", "Чеслава", "Чеславу", "Чеслава", "Чеславом", "Чеславові", "Чеславе"},
			{"", "Честислав", "Честислава", "Честиславу", "Честислава", "Честиславом", "Честиславові", "Честиславе"},
			{"", "Щастислав", "Щастислава", "Щастиславу", "Щастислава", "Щастиславом", "Щастиславові", "Щастиславе"},
			{"", "Ярослав", "Ярослава", "Ярославу", "Ярослава", "Ярославом", "Ярославові", "Ярославе"},

			{"", "Влад", "Влада", "Владу", "Влада", "Владом", "Владові", "Владе"},
			{"", "Всевлад", "Всевлада", "Всевладу", "Всевлада", "Всевладом", "Всевладові", "Всевладе"},
			{"", "Доморад", "Доморада", "Домораду", "Доморада", "Доморадом", "Доморадові", "Домораде"},
			{"", "Зорепад", "Зорепада", "Зорепаду", "Зорепада", "Зорепадом", "Зорепадові", "Зорепаде"},
			{"", "Лад", "Лада", "Ладу", "Лада", "Ладом", "Ладові", "Ладе"},
			{"", "Рад", "Рада", "Раду", "Рада", "Радом", "Радові", "Раде"},
			{"", "Семирад", "Семирада", "Семираду", "Семирада", "Семирадом", "Семирадові", "Семираде"},
			{"", "Творилад", "Творилада", "Твориладу", "Творилада", "Твориладом", "Твориладові", "Твориладе"},

			{"", "Водограй", "Водограя", "Водограю", "Водограя", "Водограєм", "Водограєві", "Водограє"},
			{"", "Держикрай", "Держикрая", "Держикраю", "Держикрая", "Держикраєм", "Держикраєві", "Держикрає"},
			// {"", "Май", "Мая", "Маю", "Мая", "Маєм", "Маєві", "Маю"},

			{"", "Аврам", "Аврама", "Авраму", "Аврама", "Аврамом", "Аврамові", "Авраме"},
			{"", "Адам", "Адама", "Адаму", "Адама", "Адамом", "Адамові", "Адаме"},

			{"", "Адріан", "Адріана", "Адріану", "Адріана", "Адріаном", "Адріанові", "Адріане"},
			{"", "Бажан", "Бажана", "Бажану", "Бажана", "Бажаном", "Бажанові", "Бажане"},
			{"", "Богдан", "Богдана", "Богдану", "Богдана", "Богданом", "Богданові", "Богдане"},
			{"", "Божан", "Божана", "Божану", "Божана", "Божаном", "Божанові", "Божане"},
			{"", "Ведан", "Ведана", "Ведану", "Ведана", "Веданом", "Веданові", "Ведане"},
			{"", "Вербан", "Вербана", "Вербану", "Вербана", "Вербаном", "Вербанові", "Вербане"},
			{"", "Веселан", "Веселана", "Веселану", "Веселана", "Веселаном", "Веселанові", "Веселане"},
			{"", "Віродан", "Віродана", "Віродану", "Віродана", "Віроданом", "Віроданові", "Віродане"},
			{"", "Вістан", "Вістана", "Вістану", "Вістана", "Вістаном", "Вістанові", "Вістане"},
			{"", "Вітан", "Вітана", "Вітану", "Вітана", "Вітаном", "Вітанові", "Вітане"},
			{"", "Вратан", "Вратана", "Вратану", "Вратана", "Вратаном", "Вратанові", "Вратане"},
			{"", "Грозан", "Грозана", "Грозану", "Грозана", "Грозаном", "Грозанові", "Грозане"},
			{"", "Дан", "Дана", "Дану", "Дана", "Даном", "Данові", "Дане"},
			{"", "Драган", "Драгана", "Драгану", "Драгана", "Драганом", "Драганові", "Драгане"},
			{"", "Жадан", "Жадана", "Жадану", "Жадана", "Жаданом", "Жаданові", "Жадане"},
			{"", "Ждан", "Ждана", "Ждану", "Ждана", "Жданом", "Жданові", "Ждане"},
			{"", "Златодан", "Златодана", "Златодану", "Златодана", "Златоданом", "Златоданові", "Златодане"},
			{"", "Злотан", "Злотана", "Злотану", "Злотана", "Злотаном", "Злотанові", "Злотане"},
			{"", "Злотодан", "Злотодана", "Злотодану", "Злотодана", "Злотоданом", "Злотоданові", "Злотодане"},
			{"", "Іван", "Івана", "Івану", "Івана", "Іваном", "Іванові", "Іване"},
			{"", "Квітан", "Квітана", "Квітану", "Квітана", "Квітаном", "Квітанові", "Квітане"},
			{"", "Милан", "Милана", "Милану", "Милана", "Миланом", "Миланові", "Милане"},
			{"", "Милован", "Милована", "Миловану", "Милована", "Милованом", "Милованові", "Миловане"},
			{"", "Мовчан", "Мовчана", "Мовчану", "Мовчана", "Мовчаном", "Мовчанові", "Мовчане"},
			{"", "Недан", "Недана", "Недану", "Недана", "Неданом", "Неданові", "Недане"},
			{"", "Радан", "Радана", "Радану", "Радана", "Раданом", "Раданові", "Радане"},
			{"", "Радован", "Радована", "Радовану", "Радована", "Радованом", "Радованові", "Радоване"},
			{"", "Родан", "Родана", "Родану", "Родана", "Роданом", "Роданові", "Родане"},
			{"", "Роксолан", "Роксолана", "Роксолану", "Роксолана", "Роксоланом", "Роксоланові", "Роксолане"},
			{"", "Роман", "Романа", "Роману", "Романа", "Романом", "Романові", "Романе"},
			{"", "Рудан", "Рудана", "Рудану", "Рудана", "Руданом", "Руданові", "Рудане"},
			{"", "Русан", "Русана", "Русану", "Русана", "Русаном", "Русанові", "Русане"},
			{"", "Руслан", "Руслана", "Руслану", "Руслана", "Русланом", "Русланові", "Руслане"},
			{"", "Русудан", "Русудана", "Русудану", "Русудана", "Русуданом", "Русуданові", "Русудане"},
			{"", "Світан", "Світана", "Світану", "Світана", "Світаном", "Світанові", "Світане"},
			{"", "Світлан", "Світлана", "Світлану", "Світлана", "Світланом", "Світланові", "Світлане"},
			{"", "Свободан", "Свободана", "Свободану", "Свободана", "Свободаном", "Свободанові", "Свободане"},
			{"", "Силан", "Силана", "Силану", "Силана", "Силаном", "Силанові", "Силане"},
			{"", "Сніжан", "Сніжана", "Сніжану", "Сніжана", "Сніжаном", "Сніжанові", "Сніжане"},
			{"", "Степан", "Степана", "Степану", "Степана", "Степаном", "Степанові", "Степане"},
			{"", "Уличан", "Уличана", "Уличану", "Уличана", "Уличаном", "Уличанові", "Уличане"},
			{"", "Худан", "Худана", "Худану", "Худана", "Худаном", "Худанові", "Худане"},
			{"", "Цвітан", "Цвітана", "Цвітану", "Цвітана", "Цвітаном", "Цвітанові", "Цвітане"},
			{"", "Юліан", "Юліана", "Юліану", "Юліана", "Юліаном", "Юліанові", "Юліане"},

			{"", "Остап", "Остапа", "Остапу", "Остапа", "Остапом", "Остапові", "Остапе"},
			{"", "Потап", "Потапа", "Потапу", "Потапа", "Потапом", "Потапові", "Потапе"},

			{"", "Азар", "Азара", "Азару", "Азара", "Азаром", "Азарові", "Азаре"},
			{"", "Благодар", "Благодара", "Благодару", "Благодара", "Благодаром", "Благодарові", "Благодаре"},
			{"", "Божедар", "Божедара", "Божедару", "Божедара", "Божедаром", "Божедарові", "Божедаре"},
			{"", "Величар", "Величара", "Величару", "Величара", "Величаром", "Величарові", "Величаре"},
			{"", "Віродар", "Віродара", "Віродару", "Віродара", "Віродаром", "Віродарові", "Віродаре"},
			{"", "Вогнедар", "Вогнедара", "Вогнедару", "Вогнедара", "Вогнедаром", "Вогнедарові", "Вогнедаре"},
			{"", "Володар", "Володара", "Володару", "Володара", "Володаром", "Володарові", "Володаре"},
			{"", "Дар", "Дара", "Дару", "Дара", "Даром", "Дарові", "Даре"},
			{"", "Захар", "Захара", "Захару", "Захара", "Захаром", "Захарові", "Захаре"},
			{"", "Колодар", "Колодара", "Колодару", "Колодара", "Колодаром", "Колодарові", "Колодаре"},
			{"", "Любодар", "Любодара", "Любодару", "Любодара", "Любодаром", "Любодарові", "Любодаре"},
			{"", "Любозар", "Любозара", "Любозару", "Любозара", "Любозаром", "Любозарові", "Любозаре"},
			{"", "Магадар", "Магадара", "Магадару", "Магадара", "Магадаром", "Магадарові", "Магадаре"},
			{"", "Макар", "Макара", "Макару", "Макара", "Макаром", "Макарові", "Макаре"},
			{"", "Милодар", "Милодара", "Милодару", "Милодара", "Милодаром", "Милодарові", "Милодаре"},
			{"", "Ростичар", "Ростичара", "Ростичару", "Ростичара", "Ростичаром", "Ростичарові", "Ростичаре"},
			{"", "Світодар", "Світодара", "Світодару", "Світодара", "Світодаром", "Світодарові", "Світодаре"},
			{"", "Світозар", "Світозара", "Світозару", "Світозара", "Світозаром", "Світозарові", "Світозаре"},
			{"", "Сонцедар", "Сонцедара", "Сонцедару", "Сонцедара", "Сонцедаром", "Сонцедарові", "Сонцедаре"},
			{"", "Стожар", "Стожара", "Стожару", "Стожара", "Стожаром", "Стожарові", "Стожаре"},

			{"", "Анастас", "Анастаса", "Анастасу", "Анастаса", "Анастасом", "Анастасові", "Анастасе"},
			{"", "Атанас", "Атанаса", "Атанасу", "Атанаса", "Атанасом", "Атанасові", "Атанасе"},
			{"", "Опанас", "Опанаса", "Опанасу", "Опанаса", "Опанасом", "Опанасові", "Опанасе"},
			{"", "Панас", "Панаса", "Панасу", "Панаса", "Панасом", "Панасові", "Панасе"},
			{"", "Спас", "Спаса", "Спасу", "Спаса", "Спасом", "Спасові", "Спасе"},
			{"", "Тарас", "Тараса", "Тарасу", "Тараса", "Тарасом", "Тарасові", "Тарасе"},
			{"", "Улас", "Уласа", "Уласу", "Уласа", "Уласом", "Уласові", "Уласе"},

			{"", "Гнат", "Гната", "Гнату", "Гната", "Гнатом", "Гнатові", "Гнате"},
			{"", "Злат", "Злата", "Злату", "Злата", "Златом", "Златові", "Злате"},
			{"", "Кіндрат", "Кіндрата", "Кіндрату", "Кіндрата", "Кіндратом", "Кіндратові", "Кіндрате"},
			{"", "Сармат", "Сармата", "Сармату", "Сармата", "Сарматом", "Сарматові", "Сармате"},

			{"", "Палац", "Палаца", "Палацу", "Палаца", "Палацом", "Палацові", "Палаце"},

			{"", "Дибач", "Дибача", "Дибачу", "Дибача", "Дибачом", "Дибачові", "Дибаче"},
			{"", "Крилач", "Крилача", "Крилачу", "Крилача", "Крилачом", "Крилачові", "Крилаче"},

			{"", "Грива", "Гриви", "Гриві", "Гриву", "Гривою", "Гриві", "Гриво"},
			{"", "Рава", "Рави", "Раві", "Раву", "Равою", "Раві", "Раво"},
			{"", "Слава", "Слави", "Славі", "Славу", "Славою", "Славі", "Славо"},

			{"", "Здоровега", "Здоровеги", "Здоровезі", "Здоровегу", "Здоровегою", "Здоровезі", "Здоровего"},
			{"", "Снага", "Снаги", "Сназі", "Снагу", "Снагою", "Сназі", "Снаго"},

			{"", "Куйбіда", "Куйбіди", "Куйбіді", "Куйбіду", "Куйбідою", "Куйбіді", "Куйбідо"},
			{"", "Нагнибіда", "Нагнибіди", "Нагнибіді", "Нагнибіду", "Нагнибідою", "Нагнибіді", "Нагнибідо"},

			// {"", "Ладо", "Лада", "Ладу", "Лада", "Ладом", "Ладові", "Ладе"},

			{"", "Велемудр", "Велемудра", "Велемудру", "Велемудра", "Велемудром", "Велемудрові", "Велемудре"},
			{"", "Любомудр", "Любомудра", "Любомудру", "Любомудра", "Любомудром", "Любомудрові", "Любомудре"},
			{"", "Олександр", "Олександра", "Олександру", "Олександра", "Олександром", "Олександрові", "Олександре"},

			{"", "Лев", "Лева", "Леву", "Лева", "Левом", "Левові", "Леве"},

			// {"", "Олег", "Олега", "Олегу", "Олега", "Олегом", "Олегові", "Олеже"},

			{"", "Атрей", "Атрея", "Атрею", "Атрея", "Атреєм", "Атреєві", "Атреє"},
			// {"", "Соловей", "Соловʼя", "Соловʼєві", "Соловʼя", "Соловʼєм", "Соловʼї", "Соловʼю"},

			// {"", "Щек", "Щека", "Щеку", "Щека", "Щеком", "Щекові", "Щеку"},
			{"", "Артем", "Артема", "Артему", "Артема", "Артемом", "Артемові", "Артеме"},

			{"", "Арсен", "Арсена", "Арсену", "Арсена", "Арсеном", "Арсенові", "Арсене"},
			{"", "Божен", "Божена", "Божену", "Божена", "Боженом", "Боженові", "Божене"},
			{"", "Євген", "Євгена", "Євгену", "Євгена", "Євгеном", "Євгенові", "Євгене"},
			{"", "Найден", "Найдена", "Найдену", "Найдена", "Найденом", "Найденові", "Найдене"},
			{"", "Пимен", "Пимена", "Пимену", "Пимена", "Пименом", "Пименові", "Пимене"},
			{"", "Рожден", "Рождена", "Рождену", "Рождена", "Рожденом", "Рожденові", "Рождене"},
			{"", "Семен", "Семена", "Семену", "Семена", "Семеном", "Семенові", "Семене"},
			{"", "Ясен", "Ясена", "Ясену", "Ясена", "Ясеном", "Ясенові", "Ясене"},

			// {"", "Гуляйвітер", "Гуляйвітра", "Гуляйвітру", "Гуляйвітра", "Гуляйвітром", "Гуляйвітрові", "Гуляйвітре"},
			{"", "Велет", "Велета", "Велету", "Велета", "Велетом", "Велетові", "Велете"},
			{"", "Позвізд", "Позвізда", "Позвізду", "Позвізда", "Позвіздом", "Позвіздові", "Позвізде"},
			{"", "Хорив", "Хорива", "Хориву", "Хорива", "Хоривом", "Хоривові", "Хориве"},

			{"", "Біловид", "Біловида", "Біловиду", "Біловида", "Біловидом", "Біловидові", "Біловиде"},
			{"", "Благовид", "Благовида", "Благовиду", "Благовида", "Благовидом", "Благовидові", "Благовиде"},
			{"", "Будивид", "Будивида", "Будивиду", "Будивида", "Будивидом", "Будивидові", "Будивиде"},
			{"", "Давид", "Давида", "Давиду", "Давида", "Давидом", "Давидові", "Давиде"},
			{"", "Демид", "Демида", "Демиду", "Демида", "Демидом", "Демидові", "Демиде"},
			{"", "Свирид", "Свирида", "Свириду", "Свирида", "Свиридом", "Свиридові", "Свириде"},
			{"", "Світовид", "Світовида", "Світовиду", "Світовида", "Світовидом", "Світовидові", "Світовиде"},
			{"", "Святовид", "Святовида", "Святовиду", "Святовида", "Святовидом", "Святовидові", "Святовиде"},
			{"", "Сновид", "Сновида", "Сновиду", "Сновида", "Сновидом", "Сновидові", "Сновиде"},
			{"", "Сонцевид", "Сонцевида", "Сонцевиду", "Сонцевида", "Сонцевидом", "Сонцевидові", "Сонцевиде"},
			{"", "Яровид", "Яровида", "Яровиду", "Яровида", "Яровидом", "Яровидові", "Яровиде"},
			{"", "Ясновид", "Ясновида", "Ясновиду", "Ясновида", "Ясновидом", "Ясновидові", "Ясновиде"},

			// {"", "Кий", "Кия", "Кию", "Кия", "Києм", "Кию", "Кию"},

			{"", "Громовик", "Громовика", "Громовику", "Громовика", "Громовиком", "Громовикові", "Громовике"},
			{"", "Добрик", "Добрика", "Добрику", "Добрика", "Добриком", "Добрикові", "Добрике"},
			{"", "Добролик", "Добролика", "Добролику", "Добролика", "Доброликом", "Доброликові", "Добролике"},
			{"", "Каленик", "Каленика", "Каленику", "Каленика", "Калеником", "Каленикові", "Каленике"},
			{"", "Малик", "Малика", "Малику", "Малика", "Маликом", "Маликові", "Малике"},
			{"", "Першик", "Першика", "Першику", "Першика", "Першиком", "Першикові", "Першике"},
			{"", "Світолик", "Світолика", "Світолику", "Світолика", "Світоликом", "Світоликові", "Світолике"},
			{"", "Сонцелик", "Сонцелика", "Сонцелику", "Сонцелика", "Сонцеликом", "Сонцеликові", "Сонцелике"},
			{"", "Таросик", "Таросика", "Таросику", "Таросика", "Таросиком", "Таросикові", "Таросике"},
			{"", "Ярчик", "Ярчика", "Ярчику", "Ярчика", "Ярчиком", "Ярчикові", "Ярчике"},
			{"", "Яснолик", "Яснолика", "Яснолику", "Яснолика", "Ясноликом", "Ясноликові", "Яснолике"},

			{"", "Братомил", "Братомила", "Братомилу", "Братомила", "Братомилом", "Братомилові", "Братомиле"},
			{"", "Будимил", "Будимила", "Будимилу", "Будимила", "Будимилом", "Будимилові", "Будимиле"},
			{"", "Гатусил", "Гатусила", "Гатусилу", "Гатусила", "Гатусилом", "Гатусилові", "Гатусиле"},
			{"", "Далемил", "Далемила", "Далемилу", "Далемила", "Далемилом", "Далемилові", "Далемиле"},
			{"", "Дорогосил", "Дорогосила", "Дорогосилу", "Дорогосила", "Дорогосилом", "Дорогосилові", "Дорогосиле"},
			{"", "Живосил", "Живосила", "Живосилу", "Живосила", "Живосилом", "Живосилові", "Живосиле"},
			{"", "Любомил", "Любомила", "Любомилу", "Любомила", "Любомилом", "Любомилові", "Любомиле"},
			{"", "Людомил", "Людомила", "Людомилу", "Людомила", "Людомилом", "Людомилові", "Людомиле"},
			{"", "Перемил", "Перемила", "Перемилу", "Перемила", "Перемилом", "Перемилові", "Перемиле"},
			{"", "Чесмил", "Чесмила", "Чесмилу", "Чесмила", "Чесмилом", "Чесмилові", "Чесмиле"},
			{"", "Яромил", "Яромила", "Яромилу", "Яромила", "Яромилом", "Яромилові", "Яромиле"},

			{"", "Вадим", "Вадима", "Вадиму", "Вадима", "Вадимом", "Вадимові", "Вадиме"},
			{"", "Герасим", "Герасима", "Герасиму", "Герасима", "Герасимом", "Герасимові", "Герасиме"},
			{"", "Любим", "Любима", "Любиму", "Любима", "Любимом", "Любимові", "Любиме"},
			{"", "Максим", "Максима", "Максиму", "Максима", "Максимом", "Максимові", "Максиме"},
			{"", "Никодим", "Никодима", "Никодиму", "Никодима", "Никодимом", "Никодимові", "Никодиме"},
			{"", "Радим", "Радима", "Радиму", "Радима", "Радимом", "Радимові", "Радиме"},
			{"", "Серафим", "Серафима", "Серафиму", "Серафима", "Серафимом", "Серафимові", "Серафиме"},
			{"", "Устим", "Устима", "Устиму", "Устима", "Устимом", "Устимові", "Устиме"},
			{"", "Юхим", "Юхима", "Юхиму", "Юхима", "Юхимом", "Юхимові", "Юхиме"},

			{"", "Августин", "Августина", "Августину", "Августина", "Августином", "Августинові", "Августине"},
			{"", "Алевтин", "Алевтина", "Алевтину", "Алевтина", "Алевтином", "Алевтинові", "Алевтине"},
			{"", "Валентин", "Валентина", "Валентину", "Валентина", "Валентином", "Валентинові", "Валентине"},
			{"", "Дорогочин", "Дорогочина", "Дорогочину", "Дорогочина", "Дорогочином", "Дорогочинові", "Дорогочине"},
			{"", "Костянтин", "Костянтина", "Костянтину", "Костянтина", "Костянтином", "Костянтинові", "Костянтине"},
			{"", "Мартин", "Мартина", "Мартину", "Мартина", "Мартином", "Мартинові", "Мартине"},
			{"", "Северин", "Северина", "Северину", "Северина", "Северином", "Северинові", "Северине"},
			{"", "Чернин", "Чернина", "Чернину", "Чернина", "Чернином", "Чернинові", "Чернине"},

			{"", "Архип", "Архипа", "Архипу", "Архипа", "Архипом", "Архипові", "Архипе"},
			{"", "Орхип", "Орхипа", "Орхипу", "Орхипа", "Орхипом", "Орхипові", "Орхипе"},
			{"", "Пилип", "Пилипа", "Пилипу", "Пилипа", "Пилипом", "Пилипові", "Пилипе"},

			{"", "Біломир", "Біломира", "Біломиру", "Біломира", "Біломиром", "Біломирові", "Біломире"},
			{"", "Божемир", "Божемира", "Божемиру", "Божемира", "Божемиром", "Божемирові", "Божемире"},
			{"", "Боримир", "Боримира", "Боримиру", "Боримира", "Боримиром", "Боримирові", "Боримире"},
			{"", "Братимир", "Братимира", "Братимиру", "Братимира", "Братимиром", "Братимирові", "Братимире"},
			{"", "Будимир", "Будимира", "Будимиру", "Будимира", "Будимиром", "Будимирові", "Будимире"},
			{"", "Буймир", "Буймира", "Буймиру", "Буймира", "Буймиром", "Буймирові", "Буймире"},
			{"", "Велемир", "Велемира", "Велемиру", "Велемира", "Велемиром", "Велемирові", "Велемире"},
			{"", "Витомир", "Витомира", "Витомиру", "Витомира", "Витомиром", "Витомирові", "Витомире"},
			{"", "Вітомир", "Вітомира", "Вітомиру", "Вітомира", "Вітомиром", "Вітомирові", "Вітомире"},
			{"", "Володимир", "Володимира", "Володимиру", "Володимира", "Володимиром", "Володимирові", "Володимире"},
			{"", "Годомир", "Годомира", "Годомиру", "Годомира", "Годомиром", "Годомирові", "Годомире"},
			{"", "Горимир", "Горимира", "Горимиру", "Горимира", "Горимиром", "Горимирові", "Горимире"},
			{"", "Градимир", "Градимира", "Градимиру", "Градимира", "Градимиром", "Градимирові", "Градимире"},
			{"", "Далемир", "Далемира", "Далемиру", "Далемира", "Далемиром", "Далемирові", "Далемире"},
			{"", "Даромир", "Даромира", "Даромиру", "Даромира", "Даромиром", "Даромирові", "Даромире"},
			{"", "Добромир", "Добромира", "Добромиру", "Добромира", "Добромиром", "Добромирові", "Добромире"},
			{"", "Дорогомир", "Дорогомира", "Дорогомиру", "Дорогомира", "Дорогомиром", "Дорогомирові", "Дорогомире"},
			{"", "Драгомир", "Драгомира", "Драгомиру", "Драгомира", "Драгомиром", "Драгомирові", "Драгомире"},
			{"", "Житомир", "Житомира", "Житомиру", "Житомира", "Житомиром", "Житомирові", "Житомире"},
			{"", "Звенимир", "Звенимира", "Звенимиру", "Звенимира", "Звенимиром", "Звенимирові", "Звенимире"},
			{"", "Златомир", "Златомира", "Златомиру", "Златомира", "Златомиром", "Златомирові", "Златомире"},
			{"", "Зоремир", "Зоремира", "Зоремиру", "Зоремира", "Зоремиром", "Зоремирові", "Зоремире"},
			{"", "Ладимир", "Ладимира", "Ладимиру", "Ладимира", "Ладимиром", "Ладимирові", "Ладимире"},
			{"", "Ладомир", "Ладомира", "Ладомиру", "Ладомира", "Ладомиром", "Ладомирові", "Ладомире"},
			{"", "Любовир", "Любовира", "Любовиру", "Любовира", "Любовиром", "Любовирові", "Любовире"},
			{"", "Любомир", "Любомира", "Любомиру", "Любомира", "Любомиром", "Любомирові", "Любомире"},
			{"", "Магамир", "Магамира", "Магамиру", "Магамира", "Магамиром", "Магамирові", "Магамире"},
			{"", "Маломир", "Маломира", "Маломиру", "Маломира", "Маломиром", "Маломирові", "Маломире"},
			{"", "Медомир", "Медомира", "Медомиру", "Медомира", "Медомиром", "Медомирові", "Медомире"},
			{"", "Межамир", "Межамира", "Межамиру", "Межамира", "Межамиром", "Межамирові", "Межамире"},
			{"", "Мизамир", "Мизамира", "Мизамиру", "Мизамира", "Мизамиром", "Мизамирові", "Мизамире"},
			{"", "Мир", "Мира", "Миру", "Мира", "Миром", "Мирові", "Мире"},
			{"", "Немир", "Немира", "Немиру", "Немира", "Немиром", "Немирові", "Немире"},
			{"", "Оримир", "Оримира", "Оримиру", "Оримира", "Оримиром", "Оримирові", "Оримире"},
			{"", "Остромир", "Остромира", "Остромиру", "Остромира", "Остромиром", "Остромирові", "Остромире"},
			{"", "Порфир", "Порфира", "Порфиру", "Порфира", "Порфиром", "Порфирові", "Порфире"},
			{"", "Радимир", "Радимира", "Радимиру", "Радимира", "Радимиром", "Радимирові", "Радимире"},
			{"", "Радомир", "Радомира", "Радомиру", "Радомира", "Радомиром", "Радомирові", "Радомире"},
			{"", "Ратимир", "Ратимира", "Ратимиру", "Ратимира", "Ратимиром", "Ратимирові", "Ратимире"},
			{"", "Світомир", "Світомира", "Світомиру", "Світомира", "Світомиром", "Світомирові", "Світомире"},
			{"", "Славомир", "Славомира", "Славомиру", "Славомира", "Славомиром", "Славомирові", "Славомире"},
			{"", "Собімир", "Собімира", "Собімиру", "Собімира", "Собімиром", "Собімирові", "Собімире"},
			{"", "Станимир", "Станимира", "Станимиру", "Станимира", "Станимиром", "Станимирові", "Станимире"},
			{"", "Стоймир", "Стоймира", "Стоймиру", "Стоймира", "Стоймиром", "Стоймирові", "Стоймире"},
			{"", "Судимир", "Судимира", "Судимиру", "Судимира", "Судимиром", "Судимирові", "Судимире"},
			{"", "Татомир", "Татомира", "Татомиру", "Татомира", "Татомиром", "Татомирові", "Татомире"},
			{"", "Творимир", "Творимира", "Творимиру", "Творимира", "Творимиром", "Творимирові", "Творимире"},
			{"", "Тихомир", "Тихомира", "Тихомиру", "Тихомира", "Тихомиром", "Тихомирові", "Тихомире"},
			{"", "Хвалимир", "Хвалимира", "Хвалимиру", "Хвалимира", "Хвалимиром", "Хвалимирові", "Хвалимире"},
			{"", "Хотимир", "Хотимира", "Хотимиру", "Хотимира", "Хотимиром", "Хотимирові", "Хотимире"},
			{"", "Хранимир", "Хранимира", "Хранимиру", "Хранимира", "Хранимиром", "Хранимирові", "Хранимире"},
			{"", "Яромир", "Яромира", "Яромиру", "Яромира", "Яромиром", "Яромирові", "Яромире"},

			{"", "Борис", "Бориса", "Борису", "Бориса", "Борисом", "Борисові", "Борисе"},
			{"", "Денис", "Дениса", "Денису", "Дениса", "Денисом", "Денисові", "Денисе"},

			{"", "Осемрит", "Осемрита", "Осемриту", "Осемрита", "Осемритом", "Осемритові", "Осемрите"},
			{"", "Яровит", "Яровита", "Яровиту", "Яровита", "Яровитом", "Яровитові", "Яровите"},

			{"", "Листвич", "Листвича", "Листвичу", "Листвича", "Листвичом", "Листвичові", "Листвиче"},
			{"", "Лука", "Луки", "Луці", "Луку", "Лукою", "Луці", "Луко"},

			// {"", "Батко", "Батка", "Батку", "Батка", "Батком", "Баткові", "Батку"},
			// {"", "Божейко", "Божейка", "Божейку", "Божейка", "Божейком", "Божейкові", "Божейку"},
			// {"", "Божко", "Божка", "Божку", "Божка", "Божком", "Божкові", "Божку"},
			// {"", "Бойко", "Бойка", "Бойку", "Бойка", "Бойком", "Бойкові", "Бойку"},
			// {"", "Братко", "Братка", "Братку", "Братка", "Братком", "Браткові", "Братку"},
			// {"", "Величко", "Величка", "Величку", "Величка", "Величком", "Величкові", "Величку"},
			// {"", "Гладко", "Гладка", "Гладку", "Гладка", "Гладком", "Гладкові", "Гладку"},
			// {"", "Голубко", "Голубка", "Голубку", "Голубка", "Голубком", "Голубкові", "Голубку"},
			// {"", "Данко", "Данка", "Данку", "Данка", "Данком", "Данкові", "Данку"},
			// {"", "Левко", "Левка", "Левку", "Левка", "Левком", "Левкові", "Левку"},
			// {"", "Марко", "Марка", "Марку", "Марка", "Марком", "Маркові", "Марку"},
			// {"", "Олелько", "Олелька", "Олельку", "Олелька", "Олельком", "Олелькові", "Олельку"},
			// {"", "Первушко", "Первушка", "Первушку", "Первушка", "Первушком", "Первушкові", "Первушку"},
			// {"", "Радечко", "Радечка", "Радечку", "Радечка", "Радечком", "Радечкові", "Радечку"},
			// {"", "Радко", "Радка", "Радку", "Радка", "Радком", "Радкові", "Радку"},
			// {"", "Сердитко", "Сердитка", "Сердитку", "Сердитка", "Сердитком", "Сердиткові", "Сердитку"},
			// {"", "Хорошко", "Хорошка", "Хорошку", "Хорошка", "Хорошком", "Хорошкові", "Хорошку"},
			// {"", "Царко", "Царка", "Царку", "Царка", "Царком", "Царкові", "Царку"},

			{"", "Вакула", "Вакули", "Вакулі", "Вакулу", "Вакулою", "Вакулі", "Вакуло"},
			{"", "Микола", "Миколи", "Миколі", "Миколу", "Миколою", "Миколі", "Миколо"},
			{"", "Сила", "Сили", "Силі", "Силу", "Силою", "Силі", "Сило"},
			{"", "Хвала", "Хвали", "Хвалі", "Хвалу", "Хвалою", "Хвалі", "Хвало"},

			// {"", "Святополк", "Святополка", "Святополку", "Святополка", "Святополком", "Святополкові", "Святополку"},
			// {"", "Ярополк", "Ярополка", "Ярополку", "Ярополка", "Ярополком", "Ярополкові", "Ярополку"},

			// {"", "Гаврило", "Гаврила", "Гаврилу", "Гаврила", "Гаврилом", "Гаврилові", "Гавриле"},
			// {"", "Данило", "Данила", "Данилу", "Данила", "Данилом", "Данилові", "Даниле"},
			// {"", "Добрило", "Добрила", "Добрилу", "Добрила", "Добрилом", "Добрилові", "Добриле"},
			// {"", "Кирило", "Кирила", "Кирилу", "Кирила", "Кирилом", "Кирилові", "Кириле"},
			// {"", "Корнило", "Корнила", "Корнилу", "Корнила", "Корнилом", "Корнилові", "Корниле"},
			// {"", "Курило", "Курила", "Курилу", "Курила", "Курилом", "Курилові", "Куриле"},
			// {"", "Михайло", "Михайла", "Михайлу", "Михайла", "Михайлом", "Михайлові", "Михайле"},
			// {"", "Павло", "Павла", "Павлу", "Павла", "Павлом", "Павлові", "Павле"},
			// {"", "Радило", "Радила", "Радилу", "Радила", "Радилом", "Радилові", "Радиле"},
			// {"", "Ярило", "Ярила", "Ярилу", "Ярила", "Ярилом", "Ярилові", "Яриле"},

			// {"", "Василь", "Василя", "Василю", "Василя", "Василем", "Василеві", "Василю"},
			// {"", "Полель", "Полеля", "Полелю", "Полеля", "Полелем", "Полелеві", "Полелю"},

			// {"", "Воля", "Волі", "Волі", "Волю", "Волею", "Волі", "Воле"},
			// {"", "Ілля", "Іллі", "Іллі", "Іллю", "Іллею", "Іллі", "Іллє"},

			{"", "Кузьма", "Кузьми", "Кузьмі", "Кузьму", "Кузьмою", "Кузьмі", "Кузьмо"},
			{"", "Сурма", "Сурми", "Сурмі", "Сурму", "Сурмою", "Сурмі", "Сурмо"},
			{"", "Ярема", "Яреми", "Яремі", "Ярему", "Яремою", "Яремі", "Яремо"},

			{"", "Іоанн", "Іоанна", "Іоанну", "Іоанна", "Іоанном", "Іоаннові", "Іоанне"},
			{"", "Добриня", "Добрині", "Добрині", "Добриню", "Добринею", "Добрині", "Добриню"},
			{"", "Остромов", "Остромова", "Остромову", "Остромова", "Остромовом", "Остромовові", "Остромове"},

			// {"", "Дарибог", "Дарибога", "Дарибогу", "Дарибога", "Дарибогом", "Дарибогові", "Дарибоже"},
			// {"", "Миробог", "Миробога", "Миробогу", "Миробога", "Миробогом", "Миробогові", "Миробоже"},
			// {"", "Молибог", "Молибога", "Молибогу", "Молибога", "Молибогом", "Молибогові", "Молибоже"},
			// {"", "Мстибог", "Мстибога", "Мстибогу", "Мстибога", "Мстибогом", "Мстибогові", "Мстибоже"},
			// {"", "Турбог", "Турбога", "Турбогу", "Турбога", "Турбогом", "Турбогові", "Турбоже"},
			// {"", "Хвалибог", "Хвалибога", "Хвалибогу", "Хвалибога", "Хвалибогом", "Хвалибогові", "Хвалибоже"},
			// {"", "Щастибог", "Щастибога", "Щастибогу", "Щастибога", "Щастибогом", "Щастибогові", "Щастибоже"},

			{"", "Всеволод", "Всеволода", "Всеволоду", "Всеволода", "Всеволодом", "Всеволодові", "Всеволоде"},
			{"", "Добривод", "Добривода", "Добриводу", "Добривода", "Добриводом", "Добриводові", "Добриводе"},
			{"", "Рогволод", "Рогволода", "Рогволоду", "Рогволода", "Рогволодом", "Рогволодові", "Рогволоде"},
			{"", "Яволод", "Яволода", "Яволоду", "Яволода", "Яволодом", "Яволодові", "Яволоде"},

			{"", "Бративой", "Бративоя", "Бративою", "Бративоя", "Бративоєм", "Бративоєві", "Бративоє"},
			{"", "Будивой", "Будивоя", "Будивою", "Будивоя", "Будивоєм", "Будивоєві", "Будивоє"},
			{"", "Мстивой", "Мстивоя", "Мстивою", "Мстивоя", "Мстивоєм", "Мстивоєві", "Мстивоє"},
			{"", "Радивой", "Радивоя", "Радивою", "Радивоя", "Радивоєм", "Радивоєві", "Радивоє"},
			{"", "Судивой", "Судивоя", "Судивою", "Судивоя", "Судивоєм", "Судивоєві", "Судивоє"},

			// {"", "Синьоок", "Синьоока", "Синьооку", "Синьоока", "Синьооком", "Синьоокові", "Синьооку"}, // Синьооче

			{"", "Вукол", "Вукола", "Вуколу", "Вукола", "Вуколом", "Вуколові", "Вуколе"},
			{"", "Світокол", "Світокола", "Світоколу", "Світокола", "Світоколом", "Світоколові", "Світоколе"},
			{"", "Скол", "Скола", "Сколу", "Скола", "Сколом", "Сколові", "Сколе"},
			{"", "Фрол", "Фрола", "Фролу", "Фрола", "Фролом", "Фролові", "Фроле"},

			{"", "Автоном", "Автонома", "Автоному", "Автонома", "Автономом", "Автономові", "Автономе"},

			{"", "Андрон", "Андрона", "Андрону", "Андрона", "Андроном", "Андронові", "Андроне"},
			{"", "Антон", "Антона", "Антону", "Антона", "Антоном", "Антонові", "Антоне"},
			{"", "Іларіон", "Іларіона", "Іларіону", "Іларіона", "Іларіоном", "Іларіонові", "Іларіоне"},
			{"", "Конон", "Конона", "Конону", "Конона", "Кононом", "Кононові", "Кононе"},
			{"", "Мирон", "Мирона", "Мирону", "Мирона", "Мироном", "Миронові", "Мироне"},
			{"", "Пантелеймон", "Пантелеймона", "Пантелеймону", "Пантелеймона", "Пантелеймоном", "Пантелеймонові", "Пантелеймоне"},
			{"", "Пимон", "Пимона", "Пимону", "Пимона", "Пимоном", "Пимонові", "Пимоне"},
			{"", "Родіон", "Родіона", "Родіону", "Родіона", "Родіоном", "Родіонові", "Родіоне"},
			{"", "Тихон", "Тихона", "Тихону", "Тихона", "Тихоном", "Тихонові", "Тихоне"},
			{"", "Харитон", "Харитона", "Харитону", "Харитона", "Харитоном", "Харитонові", "Харитоне"},

			{"", "Вишезор", "Вишезора", "Вишезору", "Вишезора", "Вишезором", "Вишезорові", "Вишезоре"},
			{"", "Віктор", "Віктора", "Віктору", "Віктора", "Віктором", "Вікторові", "Вікторе"},
			{"", "Далібор", "Далібора", "Далібору", "Далібора", "Далібором", "Даліборові", "Даліборе"},
			{"", "Єгор", "Єгора", "Єгору", "Єгора", "Єгором", "Єгорові", "Єгоре"},
			{"", "Звенигор", "Звенигора", "Звенигору", "Звенигора", "Звенигором", "Звенигорові", "Звенигоре"},
			// {"", "Ігор", "Ігора", "Ігору", "Ігора", "Ігорем", "Ігореві", "Ігоре"},

			{"", "Лютобор", "Лютобора", "Лютобору", "Лютобора", "Лютобором", "Лютоборові", "Лютоборе"},
			{"", "Нестор", "Нестора", "Нестору", "Нестора", "Нестором", "Несторові", "Несторе"},
			{"", "Непобор", "Непобора", "Непобору", "Непобора", "Непобором", "Непоборові", "Непоборе"},
			{"", "Никифор", "Никифора", "Никифору", "Никифора", "Никифором", "Никифорові", "Никифоре"},
			{"", "Острозор", "Острозора", "Острозору", "Острозора", "Острозором", "Острозорові", "Острозоре"},
			{"", "Пор", "Пора", "Пору", "Пора", "Пором", "Порові", "Поре"},
			{"", "Ратибор", "Ратибора", "Ратибору", "Ратибора", "Ратибором", "Ратиборові", "Ратиборе"},
			{"", "Світлогор", "Світлогора", "Світлогору", "Світлогора", "Світлогором", "Світлогорові", "Світлогоре"},
			{"", "Світогор", "Світогора", "Світогору", "Світогора", "Світогором", "Світогорові", "Світогоре"},
			{"", "Святогор", "Святогора", "Святогору", "Святогора", "Святогором", "Святогорові", "Святогоре"},
			{"", "Семибор", "Семибора", "Семибору", "Семибора", "Семибором", "Семиборові", "Семиборе"},
			{"", "Славобор", "Славобора", "Славобору", "Славобора", "Славобором", "Славоборові", "Славоборе"},
			{"", "Собібор", "Собібора", "Собібору", "Собібора", "Собібором", "Собіборові", "Собіборе"},
			{"", "Теодор", "Теодора", "Теодору", "Теодора", "Теодором", "Теодорові", "Теодоре"},
			{"", "Флор", "Флора", "Флору", "Флора", "Флором", "Флорові", "Флоре"},
			{"", "Хотибор", "Хотибора", "Хотибору", "Хотибора", "Хотибором", "Хотиборові", "Хотиборе"},
			{"", "Христофор", "Христофора", "Христофору", "Христофора", "Христофором", "Христофорові", "Христофоре"},
			{"", "Ясногор", "Ясногора", "Ясногору", "Ясногора", "Ясногором", "Ясногорові", "Ясногоре"},

			// {"", "Тімох", "Тімоха", "Тімоху", "Тімоха", "Тімохом", "Тімохові", "Тімоху"}, // Тімоше

			{"", "Ярош", "Яроша", "Ярошу", "Яроша", "Ярошом", "Ярошові", "Яроше"},
			{"", "Чара", "Чари", "Чарі", "Чару", "Чарою", "Чарі", "Чаро"},
			// {"", "Сварг", "Сварга", "Сваргу", "Сварга", "Сваргом", "Сваргові", "Сварго"}, // Сварже

			// {"", "Дмитро", "Дмитра", "Дмитру", "Дмитра", "Дмитром", "Дмитрові", "Дмитре"},
			// {"", "Петро", "Петра", "Петру", "Петра", "Петром", "Петрові", "Петре"},

			{"", "Альберт", "Альберта", "Альберту", "Альберта", "Альбертом", "Альбертові", "Альберте"},
			{"", "Олекса", "Олекси", "Олексі", "Олексу", "Олексою", "Олексі", "Олексо"},

			{"", "Боримисл", "Боримисла", "Боримислу", "Боримисла", "Боримислом", "Боримислові", "Боримисле"},
			{"", "Гордомисл", "Гордомисла", "Гордомислу", "Гордомисла", "Гордомислом", "Гордомислові", "Гордомисле"},
			{"", "Горимисл", "Горимисла", "Горимислу", "Горимисла", "Горимислом", "Горимислові", "Горимисле"},
			{"", "Гостомисл", "Гостомисла", "Гостомислу", "Гостомисла", "Гостомислом", "Гостомислові", "Гостомисле"},
			{"", "Густомисл", "Густомисла", "Густомислу", "Густомисла", "Густомислом", "Густомислові", "Густомисле"},
			{"", "Добромисл", "Добромисла", "Добромислу", "Добромисла", "Добромислом", "Добромислові", "Добромисле"},
			{"", "Дорогомисл", "Дорогомисла", "Дорогомислу", "Дорогомисла", "Дорогомислом", "Дорогомислові", "Дорогомисле"},
			{"", "Любомисл", "Любомисла", "Любомислу", "Любомисла", "Любомислом", "Любомислові", "Любомисле"},
			{"", "Лютомисл", "Лютомисла", "Лютомислу", "Лютомисла", "Лютомислом", "Лютомислові", "Лютомисле"},
			{"", "Остромисл", "Остромисла", "Остромислу", "Остромисла", "Остромислом", "Остромислові", "Остромисле"},
			{"", "Осмомисл", "Осмомисла", "Осмомислу", "Осмомисла", "Осмомислом", "Осмомислові", "Осмомисле"},
			{"", "Перемисл", "Перемисла", "Перемислу", "Перемисла", "Перемислом", "Перемислові", "Перемисле"},
			{"", "Радомисл", "Радомисла", "Радомислу", "Радомисла", "Радомислом", "Радомислові", "Радомисле"},
			{"", "Яромисл", "Яромисла", "Яромислу", "Яромисла", "Яромислом", "Яромислові", "Яромисле"},

			{"", "Август", "Августа", "Августу", "Августа", "Августом", "Августові", "Августе"},
			{"", "Білогост", "Білогоста", "Білогосту", "Білогоста", "Білогостом", "Білогостові", "Білогосте"},
			{"", "Благовіст", "Благовіста", "Благовісту", "Благовіста", "Благовістом", "Благовістові", "Благовісте"},
			{"", "Буревіст", "Буревіста", "Буревісту", "Буревіста", "Буревістом", "Буревістові", "Буревісте"},
			{"", "Віст", "Віста", "Вісту", "Віста", "Вістом", "Вістові", "Вісте"},
			{"", "Власт", "Власта", "Власту", "Власта", "Властом", "Властові", "Власте"},
			{"", "Гордогост", "Гордогоста", "Гордогосту", "Гордогоста", "Гордогостом", "Гордогостові", "Гордогосте"},
			{"", "Добровіст", "Добровіста", "Добровісту", "Добровіста", "Добровістом", "Добровістові", "Добровісте"},
			{"", "Доброгост", "Доброгоста", "Доброгосту", "Доброгоста", "Доброгостом", "Доброгостові", "Доброгосте"},
			{"", "Мирогост", "Мирогоста", "Мирогосту", "Мирогоста", "Мирогостом", "Мирогостові", "Мирогосте"},
			{"", "Муховіст", "Муховіста", "Муховісту", "Муховіста", "Муховістом", "Муховістові", "Муховісте"},
			{"", "Орест", "Ореста", "Оресту", "Ореста", "Орестом", "Орестові", "Оресте"},
			{"", "Радогост", "Радогоста", "Радогосту", "Радогоста", "Радогостом", "Радогостові", "Радогосте"},
			{"", "Твердигост", "Твердигоста", "Твердигосту", "Твердигоста", "Твердигостом", "Твердигостові", "Твердигосте"},
			{"", "Тригост", "Тригоста", "Тригосту", "Тригоста", "Тригостом", "Тригостові", "Тригосте"},
			{"", "Фауст", "Фауста", "Фаусту", "Фауста", "Фаустом", "Фаустові", "Фаусте"},
			{"", "Щедрогост", "Щедрогоста", "Щедрогосту", "Щедрогоста", "Щедрогостом", "Щедрогостові", "Щедрогосте"},

			// {"", "Олесь", "Олеся", "Олесю", "Олеся", "Олесем", "Олесеві", "Олесю"},
			// {"", "Тодось", "Тодося", "Тодосю", "Тодося", "Тодосем", "Тодосеві", "Тодосю"},

			{"", "Вишата", "Вишати", "Вишаті", "Вишату", "Вишатою", "Вишаті", "Вишато"},
			{"", "Гордята", "Гордяти", "Гордяті", "Гордяту", "Гордятою", "Гордяті", "Гордято"},
			{"", "Гостята", "Гостяти", "Гостяті", "Гостяту", "Гостятою", "Гостяті", "Гостято"},
			{"", "Микита", "Микити", "Микиті", "Микиту", "Микитою", "Микиті", "Микито"},
			{"", "Славута", "Славути", "Славуті", "Славуту", "Славутою", "Славуті", "Славуто"},
			{"", "Ходота", "Ходоти", "Ходоті", "Ходоту", "Ходотою", "Ходоті", "Ходото"},

			// {"", "Жито", "Жита", "Житу", "Жита", "Житом", "Житові", "Жите"},

			{"", "Вернидуб", "Вернидуба", "Вернидубу", "Вернидуба", "Вернидубом", "Вернидубові", "Вернидубе"},
			{"", "Сологуб", "Сологуба", "Сологубу", "Сологуба", "Сологубом", "Сологубові", "Сологубе"},

			// {"", "Дорогобуг", "Дорогобуга", "Дорогобугу", "Дорогобуга", "Дорогобугом", "Дорогобугові", "Дорогобуже"},
			// {"", "Царук", "Царука", "Царуку", "Царука", "Царуком", "Царукові", "Царуче"},

			{"", "Авакум", "Авакума", "Авакуму", "Авакума", "Авакумом", "Авакумові", "Авакуме"},
			{"", "Гордодум", "Гордодума", "Гордодуму", "Гордодума", "Гордодумом", "Гордодумові", "Гордодуме"},
			{"", "Добродум", "Добродума", "Добродуму", "Добродума", "Добродумом", "Добродумові", "Добродуме"},
			{"", "Стародум", "Стародума", "Стародуму", "Стародума", "Стародумом", "Стародумові", "Стародуме"},

			{"", "Горун", "Горуна", "Горуну", "Горуна", "Горуном", "Горунові", "Горуне"},
			{"", "Красун", "Красуна", "Красуну", "Красуна", "Красуном", "Красунові", "Красуне"},
			{"", "Ревун", "Ревуна", "Ревуну", "Ревуна", "Ревуном", "Ревунові", "Ревуне"},
			{"", "Ростун", "Ростуна", "Ростуну", "Ростуна", "Ростуном", "Ростунові", "Ростуне"},

			{"", "Артур", "Артура", "Артуру", "Артура", "Артуром", "Артурові", "Артуре"},
			{"", "Білотур", "Білотура", "Білотуру", "Білотура", "Білотуром", "Білотурові", "Білотуре"},
			{"", "Буйтур", "Буйтура", "Буйтуру", "Буйтура", "Буйтуром", "Буйтурові", "Буйтуре"},
			{"", "Дантур", "Дантура", "Дантуру", "Дантура", "Дантуром", "Дантурові", "Дантуре"},
			{"", "Тимур", "Тимура", "Тимуру", "Тимура", "Тимуром", "Тимурові", "Тимуре"},
			{"", "Тур", "Тура", "Туру", "Тура", "Туром", "Турові", "Туре"},
			{"", "Яртур", "Яртура", "Яртуру", "Яртура", "Яртуром", "Яртурові", "Яртуре"},

			{"", "Златоус", "Златоуса", "Златоусу", "Златоуса", "Златоусом", "Златоусові", "Златоусе"},
			{"", "Рус", "Руса", "Русу", "Руса", "Русом", "Русові", "Русе"},

			// {"", "Милодух", "Милодуха", "Милодуху", "Милодуха", "Милодухом", "Милодухові", "Милодусе"},
			// {"", "Одинець", "Одинця", "Одинцю", "Одинця", "Одинецем", "Одинецеві", "Одинецю"},

			{"", "Аскольд", "Аскольда", "Аскольду", "Аскольда", "Аскольдом", "Аскольдові", "Аскольде"},
			{"", "Оскольд", "Оскольда", "Оскольду", "Оскольда", "Оскольдом", "Оскольдові", "Оскольде"},

			{"", "Волелюб", "Волелюба", "Волелюбу", "Волелюба", "Волелюбом", "Волелюбові", "Волелюбе"},
			{"", "Вселюб", "Вселюба", "Вселюбу", "Вселюба", "Вселюбом", "Вселюбові", "Вселюбе"},
			{"", "Добролюб", "Добролюба", "Добролюбу", "Добролюба", "Добролюбом", "Добролюбові", "Добролюбе"},
			{"", "Життєлюб", "Життєлюба", "Життєлюбу", "Життєлюба", "Життєлюбом", "Життєлюбові", "Життєлюбе"},
			{"", "Ладолюб", "Ладолюба", "Ладолюбу", "Ладолюба", "Ладолюбом", "Ладолюбові", "Ладолюбе"},
			{"", "Миролюб", "Миролюба", "Миролюбу", "Миролюба", "Миролюбом", "Миролюбові", "Миролюбе"},
			{"", "Мудролюб", "Мудролюба", "Мудролюбу", "Мудролюба", "Мудролюбом", "Мудролюбові", "Мудролюбе"},
			{"", "Перелюб", "Перелюба", "Перелюбу", "Перелюба", "Перелюбом", "Перелюбові", "Перелюбе"},
			{"", "Світолюб", "Світолюба", "Світолюбу", "Світолюба", "Світолюбом", "Світолюбові", "Світолюбе"},
			{"", "Святолюб", "Святолюба", "Святолюбу", "Святолюба", "Святолюбом", "Святолюбові", "Святолюбе"},
			{"", "Силолюб", "Силолюба", "Силолюбу", "Силолюба", "Силолюбом", "Силолюбові", "Силолюбе"},
			{"", "Славолюб", "Славолюба", "Славолюбу", "Славолюба", "Славолюбом", "Славолюбові", "Славолюбе"},

			{"", "Вселюд", "Вселюда", "Вселюду", "Вселюда", "Вселюдом", "Вселюдові", "Вселюде"},

			{"", "Горигляд", "Горигляда", "Горигляду", "Горигляда", "Гориглядом", "Гориглядові", "Горигляде"},
			{"", "Зорегляд", "Зорегляда", "Зорегляду", "Зорегляда", "Зореглядом", "Зореглядові", "Зорегляде"},

			{"", "Адріян", "Адріяна", "Адріяну", "Адріяна", "Адріяном", "Адріянові", "Адріяне"},
			{"", "Білян", "Біляна", "Біляну", "Біляна", "Біляном", "Білянові", "Біляне"},
			{"", "Боян", "Бояна", "Бояну", "Бояна", "Бояном", "Боянові", "Бояне"},
			{"", "Вітрян", "Вітряна", "Вітряну", "Вітряна", "Вітряном", "Вітрянові", "Вітряне"},
			{"", "Вогнян", "Вогняна", "Вогняну", "Вогняна", "Вогняном", "Вогнянові", "Вогняне"},
			{"", "Дем'ян", "Дем'яна", "Дем'яну", "Дем'яна", "Дем'яном", "Дем'янові", "Дем'яне"},
			{"", "Зорян", "Зоряна", "Зоряну", "Зоряна", "Зоряном", "Зорянові", "Зоряне"},
			{"", "Киян", "Кияна", "Кияну", "Кияна", "Кияном", "Киянові", "Кияне"},
			{"", "Лук'ян", "Лук'яна", "Лук'яну", "Лук'яна", "Лук'яном", "Лук'янові", "Лук'яне"},
			{"", "Маркіян", "Маркіяна", "Маркіяну", "Маркіяна", "Маркіяном", "Маркіянові", "Маркіяне"},
			{"", "Мар'ян", "Мар'яна", "Мар'яну", "Мар'яна", "Мар'яном", "Мар'янові", "Мар'яне"},
			{"", "Омелян", "Омеляна", "Омеляну", "Омеляна", "Омеляном", "Омелянові", "Омеляне"},
			{"", "Подолян", "Подоляна", "Подоляну", "Подоляна", "Подоляном", "Подолянові", "Подоляне"},
			{"", "Полян", "Поляна", "Поляну", "Поляна", "Поляном", "Полянові", "Поляне"},
			{"", "Стоян", "Стояна", "Стояну", "Стояна", "Стояном", "Стоянові", "Стояне"},
			{"", "Троян", "Трояна", "Трояну", "Трояна", "Трояном", "Троянові", "Трояне"},
			{"", "Хотян", "Хотяна", "Хотяну", "Хотяна", "Хотяном", "Хотянові", "Хотяне"},

			{"", "Світояр", "Світояра", "Світояру", "Світояра", "Світояром", "Світоярові", "Світояре"},
			{"", "Святояр", "Святояра", "Святояру", "Святояра", "Святояром", "Святоярові", "Святояре"},

			{"", "Пʼєр", "Пʼєра", "Пʼєру", "Пʼєра", "Пʼєром", "Пʼєрові", "Пʼєре"},
			{"", "Гліб", "Гліба", "Глібу", "Гліба", "Глібом", "Глібові", "Глібе"},

			{"", "Оремів", "Ореміва", "Ореміву", "Ореміва", "Оремівом", "Оремівові", "Ореміве"},
			{"", "Толигнів", "Толигніва", "Толигніву", "Толигніва", "Толигнівом", "Толигнівові", "Толигніве"},
			{"", "Яків", "Якова", "Якову", "Якова", "Яковом", "Якові", "Якове"},

			// {"", "Триріг", "Трирога", "Трирогу", "Трирога", "Трирогом", "Трирогові", "Трирогу"},
			// {"", "Живорід", "Живорода", "Живороду", "Живорода", "Живородом", "Живородові", "Живороде"},

			{"", "Леонід", "Леоніда", "Леоніду", "Леоніда", "Леонідом", "Леонідові", "Леоніде"},
			// {"", "Рід", "Ріда", "Ріду", "Ріда", "Рідом", "Рідові", "Ріде"},
			// {"", "Турбрід", "Турбріда", "Турбріду", "Турбріда", "Турбрідом", "Турбрідові", "Турбріде"},

			// {"", "Авксентій", "Авксентія", "Авксентію", "Авксентія", "Авксентієм", "Авксентієві", "Авксентію"},
			// {"", "Аврелій", "Аврелія", "Аврелію", "Аврелія", "Аврелієм", "Аврелієві", "Аврелію"},
			// {"", "Амвросій", "Амвросія", "Амвросію", "Амвросія", "Амвросієм", "Амвросієві", "Амвросію"},
			// {"", "Анастасій", "Анастасія", "Анастасію", "Анастасія", "Анастасієм", "Анастасієві", "Анастасію"},
			// {"", "Анатолій", "Анатолія", "Анатолію", "Анатолія", "Анатолієм", "Анатолієві", "Анатолію"},
			// {"", "Андрій", "Андрія", "Андрію", "Андрія", "Андрієм", "Андрієві", "Андрію"},
			// {"", "Антоній", "Антонія", "Антонію", "Антонія", "Антонієм", "Антонієві", "Антонію"},
			// {"", "Анісій", "Анісія", "Анісію", "Анісія", "Анісієм", "Анісієві", "Анісію"},
			// {"", "Аркадій", "Аркадія", "Аркадію", "Аркадія", "Аркадієм", "Аркадієві", "Аркадію"},
			// {"", "Арсеній", "Арсенія", "Арсенію", "Арсенія", "Арсенієм", "Арсенієві", "Арсенію"},
			// {"", "Афанасій", "Афанасія", "Афанасію", "Афанасія", "Афанасієм", "Афанасієві", "Афанасію"},
			// {"", "Буревій", "Буревія", "Буревію", "Буревія", "Буревієм", "Буревієві", "Буревію"},
			// {"", "Валерій", "Валерія", "Валерію", "Валерія", "Валерієм", "Валерієві", "Валерію"},
			// {"", "Варфоломій", "Варфоломія", "Варфоломію", "Варфоломія", "Варфоломієм", "Варфоломієві", "Варфоломію"},
			// {"", "Веремій", "Веремія", "Веремію", "Веремія", "Веремієм", "Веремієві", "Веремію"},
			// {"", "Віталій", "Віталія", "Віталію", "Віталія", "Віталієм", "Віталієві", "Віталію"},
			// {"", "Геннадій", "Геннадія", "Геннадію", "Геннадія", "Геннадієм", "Геннадієві", "Геннадію"},
			// {"", "Георгій", "Георгія", "Георгію", "Георгія", "Георгієм", "Георгієві", "Георгію"},
			// {"", "Гервасій", "Гервасія", "Гервасію", "Гервасія", "Гервасієм", "Гервасієві", "Гервасію"},
			// {"", "Гордій", "Гордія", "Гордію", "Гордія", "Гордієм", "Гордієві", "Гордію"},
			// {"", "Григорій", "Григорія", "Григорію", "Григорія", "Григорієм", "Григорієві", "Григорію"},
			// {"", "Дарій", "Дарія", "Дарію", "Дарія", "Дарієм", "Дарієві", "Дарію"},
			// {"", "Дій", "Дія", "Дію", "Дія", "Дієм", "Дієві", "Дію"},
			// {"", "Добрибій", "Добрибія", "Добрибію", "Добрибія", "Добрибієм", "Добрибієві", "Добрибію"},
			// {"", "Дорофій", "Дорофія", "Дорофію", "Дорофія", "Дорофієм", "Дорофієві", "Дорофію"},
			// {"", "Євгеній", "Євгенія", "Євгенію", "Євгенія", "Євгенієм", "Євгенієві", "Євгенію"},
			// {"", "Євлампій", "Євлампія", "Євлампію", "Євлампія", "Євлампієм", "Євлампієві", "Євлампію"},
			// {"", "Єремій", "Єремія", "Єремію", "Єремія", "Єремієм", "Єремієві", "Єремію"},
			// {"", "Євстафій", "Євстафія", "Євстафію", "Євстафія", "Євстафієм", "Євстафієві", "Євстафію"},
			// {"", "Захарій", "Захарія", "Захарію", "Захарія", "Захарієм", "Захарієві", "Захарію"},
			// {"", "Зіновій", "Зіновія", "Зіновію", "Зіновія", "Зіновієм", "Зіновієві", "Зіновію"},
			// {"", "Зиновій", "Зиновія", "Зиновію", "Зиновія", "Зиновієм", "Зиновієві", "Зиновію"},
			// {"", "Корній", "Корнія", "Корнію", "Корнія", "Корнієм", "Корнієві", "Корнію"},
			// {"", "Корнилій", "Корнилія", "Корнилію", "Корнилія", "Корнилієм", "Корнилієві", "Корнилію"},
			// {"", "Корнелій", "Корнелія", "Корнелію", "Корнелія", "Корнелієм", "Корнелієві", "Корнелію"},
			// {"", "Колодій", "Колодія", "Колодію", "Колодія", "Колодієм", "Колодієві", "Колодію"},
			// {"", "Лаврентій", "Лаврентія", "Лаврентію", "Лаврентія", "Лаврентієм", "Лаврентієві", "Лаврентію"},
			// {"", "Маврикій", "Маврикія", "Маврикію", "Маврикія", "Маврикієм", "Маврикієві", "Маврикію"},
			// {"", "Матвій", "Матвія", "Матвію", "Матвія", "Матвієм", "Матвієві", "Матвію"},
			// {"", "Мусій", "Мусія", "Мусію", "Мусія", "Мусієм", "Мусієві", "Мусію"},
			// {"", "Надій", "Надія", "Надію", "Надія", "Надієм", "Надієві", "Надію"},
			// {"", "Назарій", "Назарія", "Назарію", "Назарія", "Назарієм", "Назарієві", "Назарію"},
			// {"", "Ондрій", "Ондрія", "Ондрію", "Ондрія", "Ондрієм", "Ондрієві", "Ондрію"},
			// {"", "Онісій", "Онісія", "Онісію", "Онісія", "Онісієм", "Онісієві", "Онісію"},
			// {"", "Олексій", "Олексія", "Олексію", "Олексія", "Олексієм", "Олексієві", "Олексію"},
			// {"", "Онуфрій", "Онуфрія", "Онуфрію", "Онуфрія", "Онуфрієм", "Онуфрієві", "Онуфрію"},
			// {"", "Сергій", "Сергія", "Сергію", "Сергія", "Сергієм", "Сергієві", "Сергію"},
			// {"", "Солопій", "Солопія", "Солопію", "Солопія", "Солопієм", "Солопієві", "Солопію"},
			// {"", "Стефаній", "Стефанія", "Стефанію", "Стефанія", "Стефанієм", "Стефанієві", "Стефанію"},
			// {"", "Теодозій", "Теодозія", "Теодозію", "Теодозія", "Теодозієм", "Теодозієві", "Теодозію"},
			// {"", "Терентій", "Терентія", "Терентію", "Терентія", "Терентієм", "Терентієві", "Терентію"},
			// {"", "Тимофій", "Тимофія", "Тимофію", "Тимофія", "Тимофієм", "Тимофієві", "Тимофію"},
			// {"", "Юлій", "Юлія", "Юлію", "Юлія", "Юлієм", "Юлієві", "Юлію"},
			// {"", "Юрій", "Юрія", "Юрію", "Юрія", "Юрієм", "Юрієві", "Юрію"},

			// {"", "Домінік", "Домініка", "Домініку", "Домініка", "Домініком", "Домінікові", "Домініку"}, // Домініче
			{"", "Сокіл", "Сокола", "Соколу", "Сокола", "Соколом", "Соколові", "Соколе"},

			{"", "Охрім", "Охріма", "Охріму", "Охріма", "Охрімом", "Охрімові", "Охріме"},
			{"", "Антін", "Антіна", "Антіну", "Антіна", "Антіном", "Антінові", "Антіне"},
			{"", "Лаврін", "Лавріна", "Лавріну", "Лавріна", "Лавріном", "Лаврінові", "Лавріне"},
			{"", "Онтін", "Онтіна", "Онтіну", "Онтіна", "Онтіном", "Онтінові", "Онтіне"},
			{"", "Пимін", "Пиміна", "Пиміну", "Пиміна", "Пиміном", "Пимінові", "Пиміне"},

			{"", "Вір", "Віра", "Віру", "Віра", "Віром", "Вірові", "Віре"},
			// {"", "Гострозір", "Гострозіра", "Гострозіру", "Гострозіра", "Гострозіром", "Гострозірові", "Гострозіре"},
			// {"", "Дивозір", "Дивозіра", "Дивозіру", "Дивозіра", "Дивозіром", "Дивозірові", "Дивозіре"},
			// {"", "Ничипір", "Ничипіра", "Ничипіру", "Ничипіра", "Ничипіром", "Ничипірові", "Ничипіре"},
			// {"", "Снозір", "Снозіра", "Снозіру", "Снозіра", "Снозіром", "Снозірові", "Снозіре"},
			// {"", "Федір", "Федіра", "Федіру", "Федіра", "Федіром", "Федірові", "Федіре"},
			// {"", "Явір", "Явіра", "Явіру", "Явіра", "Явіром", "Явірові", "Явіре"},
			// {"", "Яснозір", "Яснозіра", "Яснозіру", "Яснозіра", "Яснозіром", "Яснозірові", "Яснозіре"},

			{"", "Горисвіт", "Горисвіта", "Горисвіту", "Горисвіта", "Горисвітом", "Горисвітові", "Горисвіте"},
			{"", "Горицвіт", "Горицвіта", "Горицвіту", "Горицвіта", "Горицвітом", "Горицвітові", "Горицвіте"},
			{"", "Добрисвіт", "Добрисвіта", "Добрисвіту", "Добрисвіта", "Добрисвітом", "Добрисвітові", "Добрисвіте"},
			{"", "Лоліт", "Лоліта", "Лоліту", "Лоліта", "Лолітом", "Лолітові", "Лоліте"},
			{"", "Пересвіт", "Пересвіта", "Пересвіту", "Пересвіта", "Пересвітом", "Пересвітові", "Пересвіте"},
			{"", "Світ", "Світа", "Світу", "Світа", "Світом", "Світові", "Світе"},
			{"", "Яросвіт", "Яросвіта", "Яросвіту", "Яросвіта", "Яросвітом", "Яросвітові", "Яросвіте"},

			// {"", "Тиміш", "Тиміша", "Тимішу", "Тиміша", "Тимішем", "Тимішеві", "Тиміше"},
			{"", "Рафаїл", "Рафаїла", "Рафаїлу", "Рафаїла", "Рафаїлом", "Рафаїлові", "Рафаїле"},
		}

		// TODO:
		// test names with dashes
		//
		// g.Describe("Inflect names with dash", func() {
		// 	tdtItems := [][]string{
		// 	}

		// 	for _, cases := range tdtItems {
		// 		for caseNum := 2; caseNum < 8; caseNum++ {
		// 			name := cases[caseNum]

		// 			g.It(fmt.Sprintf("[%d] %-16s => %s", caseNum, cases[C_NOMINATIVE], name), func() {
		// 				lowNameParts := strings.Split(strings.ToLower(cases[C_NOMINATIVE]), "-")
		// 				result := femNounPartsToCaseN(lowNameParts, uint8(caseNum))
		// 				g.Assert(result).Equal(name)
		// 			})
		// 		}
		// 	}
		// })

		g.Describe("2. Nominative to Genitive", func() {
			for _, cases := range tdtItems {
				g.It(getTitleOf(cases, C_GENITIVE), func() {
					res := manNounToCaseN(strings.ToLower(cases[C_NOMINATIVE]), C_GENITIVE)
					g.Assert(res).Equal(cases[C_GENITIVE])
				})
			}
		})

		g.Describe("3. Nominative to Dative", func() {
			for _, cases := range tdtItems {
				g.It(getTitleOf(cases, C_DATIVE), func() {
					res := manNounToCaseN(strings.ToLower(cases[C_NOMINATIVE]), C_DATIVE)
					g.Assert(res).Equal(cases[C_DATIVE])
				})
			}
		})

		g.Describe("4. Nominative to Accusative", func() {
			for _, cases := range tdtItems {
				g.It(getTitleOf(cases, C_ACCUSATIVE), func() {
					res := manNounToCaseN(strings.ToLower(cases[C_NOMINATIVE]), C_ACCUSATIVE)
					g.Assert(res).Equal(cases[C_ACCUSATIVE])
				})
			}
		})

		g.Describe("5. Nominative to Instrumental", func() {
			for _, cases := range tdtItems {
				g.It(getTitleOf(cases, C_INSTRUMENTAL), func() {
					res := manNounToCaseN(strings.ToLower(cases[C_NOMINATIVE]), C_INSTRUMENTAL)
					g.Assert(res).Equal(cases[C_INSTRUMENTAL])
				})
			}
		})

		g.Describe("6. Nominative to Locative", func() {
			for _, cases := range tdtItems {
				g.It(getTitleOf(cases, C_LOCATIVE), func() {
					res := manNounToCaseN(strings.ToLower(cases[C_NOMINATIVE]), C_LOCATIVE)
					g.Assert(res).Equal(cases[C_LOCATIVE])
				})
			}
		})

		g.Describe("7. Nominative to Vocative", func() {
			for _, cases := range tdtItems {
				g.It(getTitleOf(cases, C_VOCATIVE), func() {
					res := manNounToCaseN(strings.ToLower(cases[C_NOMINATIVE]), C_VOCATIVE)
					g.Assert(res).Equal(cases[C_VOCATIVE])
				})
			}
		})
	})
}
